define(function (){
    return {
        data:{
            "nodes": [{
                "id": 1,
                "label": "冠心病",
                "size": 66,
                "scale": "2.0",
                "color": "rgb(255,0,50)"
            }
                ,
                {
                    "id": 2,
                    "label": "病因",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 3,
                    "label": "年龄",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 4,
                    "label": "性别　",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 5,
                    "label": "家族史",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 6,
                    "label": "个体类型",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 7,
                    "label": "吸烟",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 8,
                    "label": "高血压",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 9,
                    "label": "高脂血症",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 10,
                    "label": "糖尿病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 11,
                    "label": "肥胖和运动量过少",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 12,
                    "label": "其他",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 13,
                    "label": "饮酒",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 14,
                    "label": "口服避孕药",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 15,
                    "label": "饮食习惯",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 16,
                    "label": "冠心病的发病机制 ",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 17,
                    "label": "冠状动脉发生粥样硬化是否即发生冠心病，一定程度上取决于冠状动脉粥样硬化造成血管腔狭窄的程度",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 18,
                    "label": "除与冠脉狭窄程度有关外，更重要的取决于粥样斑块的稳定性",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 19,
                    "label": "导致急性冠状动脉疾病的发生这在“急性冠状动脉综合征”的发生发展中起着重要作用",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 20,
                    "label": "造成冠脉痉挛的原因因素",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 21,
                    "label": "神经因素",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 22,
                    "label": "体液因素",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 23,
                    "label": "粥样硬化的血管对各种缩血管物质的收缩反应性明显亢进，此为胆固醇促进细胞外钙离子流向细胞内所致",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 24,
                    "label": "冠心病发病的病理生理基础",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 25,
                    "label": "心肌耗氧量的决定因素",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 26,
                    "label": "心肌供氧量的决定因素",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 27,
                    "label": "心肌供氧和需氧量的失衡",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 28,
                    "label": "心肌缺血对心脏的影响",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 29,
                    "label": "临床表现 由于病理解剖和病理生理变化的不同，冠心病有不同的临床表现。目前把冠心病分类两大类：急性冠脉综合征、慢性冠脉病。其中前者包括不稳定型心绞痛（UA）、非ST段抬高性心肌梗死（NSTEMI）、ST段抬高性心肌梗死（STEMI）。后者包括慢性稳定型心绞痛、冠脉正常的心绞痛（如X综合征）、无症状性心肌缺血和缺血性心力衰竭。",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 30,
                    "label": "无症状性冠心病 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 31,
                    "label": "心绞痛型冠心病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 32,
                    "label": "初发型心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 33,
                    "label": "稳定型心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 34,
                    "label": "恶化型心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 35,
                    "label": "自发性心绞痛",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 36,
                    "label": "卧位型心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 37,
                    "label": "变异型心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 38,
                    "label": "中间综合征",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 39,
                    "label": "梗死后心绞痛",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 40,
                    "label": "混合性心绞痛",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 41,
                    "label": "心肌梗死型冠心病 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 42,
                    "label": "心力衰竭和心律失常型冠心病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 43,
                    "label": "猝死型冠心病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 44,
                    "label": "并发症",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 45,
                    "label": "心脏性猝死",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 46,
                    "label": "心律失常",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 47,
                    "label": "心力衰竭",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 48,
                    "label": "二尖瓣脱垂",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 49,
                    "label": "诊断方法",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 50,
                    "label": "病史、症状 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 51,
                    "label": "实验室检查",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 52,
                    "label": "血清高脂蛋白血症的表现",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 53,
                    "label": "出现心肌梗死可出现血清心肌酶检查的异常",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 54,
                    "label": "心肌梗死时血清肌红蛋白、肌钙蛋白都可增高　",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 55,
                    "label": "辅助检查",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 56,
                    "label": "心电图",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 57,
                    "label": "动态心电图 ",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 58,
                    "label": "心电图运动试验",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 59,
                    "label": "心脏药物负荷试验",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 60,
                    "label": "经食管心房调搏负荷试验",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 61,
                    "label": "X线胸片",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 62,
                    "label": "冠状动脉造影(含左室造影)",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 63,
                    "label": "心脏CT",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 64,
                    "label": "超声心动图 ",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 65,
                    "label": "核素显像",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 66,
                    "label": "鉴别",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 67,
                    "label": "心绞痛型冠心病要与食管疾病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 68,
                    "label": "心肌梗死型冠心病要与主动脉夹层、不稳定心绞痛、肺栓塞、急性心包炎急腹症、食管破裂等疾病鉴别。　　",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 69,
                    "label": "治疗",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 70,
                    "label": "冠心病的药物治疗",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 71,
                    "label": "硝酸酯类制剂",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 72,
                    "label": "β受体阻滞药",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 73,
                    "label": "钙拮抗药",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 74,
                    "label": "调脂药、抗凝和抗血小板药",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 75,
                    "label": "其他冠状动脉扩张药",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 76,
                    "label": "冠心病的介入治疗",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 77,
                    "label": "经皮冠状动脉腔内成形术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 78,
                    "label": "作用机制",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 79,
                    "label": "适应证",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 80,
                    "label": "早期适应证",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 81,
                    "label": "扩展适应证",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 82,
                    "label": "临床适应证",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(224,111,18)"
                }
                ,
                {
                    "id": 83,
                    "label": "血管适应证",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(224,111,18)"
                }
                ,
                {
                    "id": 84,
                    "label": "病变适应证",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(224,111,18)"
                }
                ,
                {
                    "id": 85,
                    "label": "冠状动脉病变特征分为A、B、C 三型",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 86,
                    "label": "A型病变",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 87,
                    "label": "B型病变",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 88,
                    "label": "C型病变",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 89,
                    "label": "A.护理",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 90,
                    "label": "B.用药",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 91,
                    "label": "冠状动脉闭塞",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 92,
                    "label": "冠状动脉内膜撕裂和夹层",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 93,
                    "label": "冠状动脉痉挛",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 94,
                    "label": "冠状动脉栓塞",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 95,
                    "label": "冠状动脉破裂或穿孔",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 96,
                    "label": "心律失常",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 97,
                    "label": "临床表现",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 98,
                    "label": "PTCA术后消失或显著减轻的劳累性心绞痛又复发，运动试验再度阳性或运动耐量减低",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 99,
                    "label": "采用的再狭窄的定义",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 100,
                    "label": "PTCA后再狭窄的处理应根据病人的具体情况",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 101,
                    "label": "冠状动脉内支架术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 102,
                    "label": "急性或亚急性血栓形成",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 103,
                    "label": "出血",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 104,
                    "label": "侧支闭塞",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 105,
                    "label": "支架脱载",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 106,
                    "label": "冠状动脉内旋切术与旋磨术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 107,
                    "label": "经皮冠状动脉激光成形术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 108,
                    "label": "冠状动脉超声血管成形术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 109,
                    "label": "射频热球囊血管成形术",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 110,
                    "label": "冠心病的外科治疗",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 111,
                    "label": "病例",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 112,
                    "label": "手术适应证",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 113,
                    "label": "心绞痛：经内科治疗",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 114,
                    "label": "急性心肌梗死",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 115,
                    "label": "心肌梗死后心绞痛",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 116,
                    "label": "充血性心力衰竭",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 117,
                    "label": "手术禁忌证",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 118,
                    "label": "严重心肺功能不全者",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 119,
                    "label": "冠状动脉弥漫性病变",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 120,
                    "label": "脑血管后遗症偏瘫，糖尿病，肥胖症和其他重要脏器严重病变者",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 121,
                    "label": "冠心病二级预防 ",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 122,
                    "label": "阿司匹林(Aspirin)和血管紧张素转换酶抑制剂(ACEI) ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 123,
                    "label": "β受体阻滞剂(Betablocker)和控制血压(Blood Pressure) ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 124,
                    "label": "降低胆固醇(Cholesterol)和戒烟(Cigarettes) ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 125,
                    "label": "控制饮食(Diet)和治疗糖尿病(Diabetes) ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 126,
                    "label": "教育(Education)和体育锻炼(Exercise) ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 127,
                    "label": "冠心病有利的食物 ",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 128,
                    "label": "玉米 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 129,
                    "label": "麦芽 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 130,
                    "label": "蔬菜和水果 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 131,
                    "label": "豆类 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 132,
                    "label": "全称冠状动脉粥样硬化性心脏病，有时也叫缺血性心脏病，是指冠状动脉粥样硬化导致心肌缺血、缺氧而引起的心脏病。冠状动脉是唯一供给心脏血液的血管，其形态似冠状，故称为冠状动脉。这条血管也随同全身血管一样的硬化，呈粥样改变，造成供养心脏血液循环障碍，引起心肌缺血、缺氧，即为冠心病。冠心病是中、老年人的常见病，多发病，严重危及人的生命。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 133,
                    "label": "对冠状动脉粥样硬化性心脏病进行的大量流行病学研究表明，以下因素与冠心病发病密切相关，这些因素被称之为冠心病易患因素(也称之为危险因素)。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 134,
                    "label": "本病多见于40岁以上的人动脉粥样硬化的发生可始于儿童，而冠心病的发病率随年龄增加而增加。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 135,
                    "label": "男性较多见，男女发病率的比例约为2∶1。因为雌激素有抗动脉粥样硬化作用，故女性在绝经期后发病率迅速增加。　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 136,
                    "label": "有冠心病、糖尿病、高血压、高脂血症家族史者，冠心病的发病率增加。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 137,
                    "label": "A型性格者(争强好胜、竞争性强) 有较高的冠心病患病率，精神过度紧张者也易患病。可能与体内儿茶酚胺类物质浓度长期过高有关。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 138,
                    "label": "吸烟是冠心病的重要危险因素。吸烟者冠心病的患病率比不吸烟者高5倍，且与吸烟量成正比。吸烟者血中一氧化碳血红蛋白增高，烟中尼古丁收缩血管，以致动脉壁缺氧而造成动脉损伤。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 139,
                    "label": "高血压是冠心病的重要危险因素。高血压病人患冠心病者是血压正常者的4倍，冠心病病人中60%～70%患有高血压动脉压增高时的切应力和侧壁压力改变造成血管内膜损伤，同时血压升高促使血浆脂质渗入血管内膜细胞，因此引起血小板聚积和平滑肌细胞增生，发生动脉粥样硬化。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 140,
                    "label": "高胆固醇血症是冠心病的重要危险因素高胆固醇血症(总胆固醇＞6.76mmol/L低密度脂蛋白胆固醇＞4.42mmol/L)者较正常者(总胆固醇＜5.2mmol/L)冠心病的危险性增加5倍。近年的研究表明，高甘油三酯血症也是冠心病的独立危险因素。高密度脂蛋白对冠心病有保护作用其值降低者易患冠心病，高密度脂蛋白胆固醇与总胆固醇之比＜0.15是冠状动脉粥样硬化有价值的预报指标。最近的研究发现血清α-脂蛋白[Lp(α)]浓度升高(＞0.3g/L)也是冠心病的独立危险因素。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 141,
                    "label": "糖尿病是冠心病的重要危险因素。糖尿病患者发生冠心病的危险性比正常人高2倍；女性糖尿病患者发生冠心病的危险性比男性患者高3倍且易发生心力衰竭、卒中和死亡高血糖时血中糖基化的低密度脂蛋白增高使经低密度脂蛋白受体途径的降解代谢受抑制；同时高血糖也使血管内膜受损，加之糖尿病常伴脂质代谢异常，故糖尿病者易患冠心病。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 142,
                    "label": "①标准体重(kg)=身高(cm)-105(或110)。②体重指数=体重(kg)/(身高m)^2。超过标准体重20%或体重指数＞24者称肥胖症。肥胖虽不如高血压、高脂血症、糖尿病那么重要，但肥胖可通过促进这三项因素的发生发展而间接影响冠心病。运动能调节和改善血管内皮功能，促使已患冠心病患者其冠脉侧支循环的建立，运动量少易致肥胖，因此应充分认识到治疗肥胖症的紧迫性和增加运动量的重要性　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 143,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 144,
                    "label": "长期大量饮高度白酒对心脏、血管、肝脏等脏器的功能有损伤作用，可招致酒精性心肌病、肝硬化、高血压的发生；而适量饮低度数的有色酒(例如葡萄酒)可降低冠心病的危险性，因为饮酒可使高密度脂蛋白浓度增高 ",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 145,
                    "label": "长期口服避孕药可使血压升高、血脂增高糖耐量异常，同时改变凝血机制增加血栓形成机会。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 146,
                    "label": "进食高热量高动物脂肪、高胆固醇、高糖饮食易患冠心病，其他还有微量元素的摄入量的改变等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 147,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 148,
                    "label": "冠状动脉发生粥样硬化是否即发生冠心病，一定程度上取决于冠状动脉粥样硬化造成血管腔狭窄的程度。  病理学上常按狭窄最严重部位的横断面，采用四级分类法：Ⅰ级，管腔狭窄面积≤25%；Ⅱ级，管腔狭窄面积为26%～50%；Ⅲ级，为51%～75%；Ⅳ级，为76%～100%。一般Ⅰ～Ⅱ级粥样硬化并不引起明显的冠状动脉血流量的减少，除冠状动脉痉挛外对冠心病发病并无直接影响。因此，虽然有冠状动脉粥样硬化，但临床可无冠心病的表现，或虽有“冠心病表现”却并非冠心病所致。Ⅲ级以上狭窄者则与冠心病的发生有直接关系。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 149,
                    "label": "近年研究表明有无冠心病表现，除与冠脉狭窄程度有关外，更重要的取决于粥样斑块的稳定性。动脉发生粥样硬化时，特别在老年人和严重斑块处容易有大量钙盐沉着，而正常的动脉不会发生钙化；虽然钙化程度与动脉粥样硬化严重程度、特别是狭窄程度不成比例，但从血管超声中可观察到钙化斑块通常都相对稳定的。问题是部分无钙化的斑块，或者当斑块发展为厚的钙化帽与邻近区内膜间的应力增加时，这些情形易造成冠状动脉粥样硬化斑块的破裂、出血和随后血管腔内的血栓形成，导致“急性冠状动脉综合征”的发生，出现不稳定型心绞痛心肌梗死甚至猝死。病理可见斑块破裂常发生在钙化与非钙化动脉粥样硬化病变的交界处。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 150,
                    "label": "不引起症状的动脉粥样硬化病变可能在生命的很早期就已出现但一旦病变斑块迅速扩大，则可导致急性冠状动脉疾病的发生这在“急性冠状动脉综合征”的发生发展中起着重要作用。斑块扩大尤其在伴有冠心病危险因素(例如高胆固醇血症等)的人群中会更快，因此，积极控制冠心病危险因素是防治冠心病的重要措施。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 151,
                    "label": "在部分病人，冠心病的发生是冠状动脉痉挛所致不过，此种情况下大多同时伴有冠状动脉粥样硬化。造成冠脉痉挛的原因有以下几方面的因素：",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 152,
                    "label": "神经因素：冠状动脉有丰富的α受体交感神经兴奋、运动、冷加压试验均可以诱发冠脉痉挛；其次，通过毒蕈碱受体，迷走神经兴奋也可诱发冠脉痉挛，遇此情形可用阿托品对抗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 153,
                    "label": "体液因素：①前列环素(PGI2)与血栓素(TXA2)的平衡也直接影响着冠脉的舒缩状态：PGI2由血管内皮细胞合成，有明显的扩血管作用，TXA2为血小板聚集时所释放，有强烈收缩血管作用，当PGI2降低和(或)TXA2增高时，均可导致冠脉痉挛。②血小板聚集时释放的5-羟色胺等缩血管物质，在冠脉收缩或痉挛的发生中也起一定作用。③血清钙镁离子的作用：钙离子增多、氢离子减少时，钙离子更多地进入细胞内，增加冠脉张力而发生冠脉痉挛；过度换气、静滴碱性药物造成血液碱中毒可诱发冠脉痉挛；镁缺乏也可引起冠脉收缩。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 154,
                    "label": "粥样硬化的血管对各种缩血管物质的收缩反应性明显亢进，此为胆固醇促进细胞外钙离子流向细胞内所致。此外，内皮损伤时除PGI2合成减少、TXA2增多外，正常内皮细胞合成的内皮源性松弛因子下降从而对抗ADP、5-羟色胺、凝血酶等缩血管物质的收缩血管作用降低。最近的研究还观察到，乙酰胆碱使有正常内皮功能的冠脉松弛，而使有粥样硬化的血管发生收缩。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 155,
                    "label": "冠心病发病的病理生理基础 在冠状动脉粥样硬化病变的基础上，心肌供氧和需氧量的失衡，是引起心肌缺血缺氧，导致冠心病发生的病理生理基础。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 156,
                    "label": "心肌耗氧量的决定因素：心肌自冠状循环中摄取可利用的氧占所需氧分的75%，用于产生高磷酸化合物。心肌氧耗量的多少主要由心肌张力、心肌收缩力和心率三个要素决定，其他三个次要因素是基础代谢、电激动和心肌纤维缩短。动脉收缩压心率与射血时间的“三乘积”与左室压力曲线收缩面积与心率，即张力-时间指数密切相关；但临床上常采用更为简单的方法即收缩压与心率的“二乘积”作为心肌氧耗量指标，例如观察劳累型心绞痛的阈值时常用该项指标。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 157,
                    "label": "心肌供氧量的决定因素：心脏的肌肉即心肌从其所构成的房室腔所包容的血液中直接摄取的氧分量仅25%左右，心肌所需的氧分主要靠冠状动脉的血流供给因此冠状动脉血流量是影响心肌供氧最主要的因素。人在休息状态下，心肌从冠脉血液中摄取的氧分已接近最大值，当需氧量增加时已难从冠脉血液中更多地摄取氧，只能依靠增加冠状动脉的血液量来提供。正常情况下冠脉循环储备力大剧烈运动、缺氧时冠脉扩张，其血流量可增至休息时的4～7倍；而冠脉粥样硬化狭窄和堵塞则成为限制氧化血液传送至心肌的最主要原因。此外，心脏收缩与舒张的机械活动心肌细胞的代谢、神经体液及多种血管活性物质均参与冠脉血流量的调节。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 158,
                    "label": "心肌供氧和需氧量的失衡：任何原因导致心肌供氧和(或)需氧量超过机体代偿范围时，都将招致心肌氧的供需失衡从而导致心肌缺血的发生。其中以冠状动脉粥样硬化所致的冠心病心肌缺血最为常见。因此应注意临床上所谓的“心肌缺血”虽以冠心病最常见但并不等于冠心病；冠心病与缺血性心脏病则为同义词。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 159,
                    "label": "心肌缺血对心脏的影响：心肌缺血时，糖酵解成为ATP的主要来源。故此时心肌除乳酸量增加外因能量不足而使得心脏的收缩和舒张功能受到影响。当心肌缺血较重(包括急性心肌梗死病灶周围急性严重缺血或冠脉再灌注后尚未发生坏死的心肌)且持续时间较长时，心肌发生可逆性损伤，随血供恢复，心肌结构、代谢和功能缓慢恢复，需时数小时数天甚至数周，处于该种状态的心肌称为心肌顿抑 (stunned myocardium)在冠心病病人，为适应血流量低于正常的状况，某些心肌可“自动”调低耗氧量，以保证心肌氧的供需在新的水平达到平衡心肌功能随血供恢复而恢复，像这种既不发生心肌梗死、又无缺血症状的存活心肌被称为心肌冬眠(hibernating myocardium)一般认为这是心肌的一种保护性机制，一旦供血改善则心肌功能可完全恢复。冠状动脉粥样硬化狭窄产生心肌缺血时，代谢产物等可刺激冠脉扩张，以增加血流量这种“反应性充血反应”现象随狭窄程度增加而逐渐减弱，直至冠脉狭窄程度＞90%时完全消失。同时，慢性缺血可促使侧支循环的建立。这些代偿机制均有利于保持心肌氧的供需平衡病人在较长时间内可无心肌缺血的表现。只有当心肌耗氧量明显增加，冠脉血流量和侧支血流不足以维持这种平衡时，才出现心肌缺血的表现。在粥样硬化基础上，迅速发生的斑块破裂和(或)出血、痉挛及完全性或不完全性血栓性堵塞等急性病变，引起急性冠状动脉综合征，临床表现为不稳定型心绞痛急性心肌梗死或猝死。　 　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 160,
                    "label": "由于病理解剖和病理生理变化的不同，冠心病有不同的临床表现。目前把冠心病分类两大类：急性冠脉综合征、慢性冠脉病。其中前者包括不稳定型心绞痛（UA）、非ST段抬高性心肌梗死（NSTEMI）、ST段抬高性心肌梗死（STEMI）。后者包括慢性稳定型心绞痛、冠脉正常的心绞痛（如X综合征）、无症状性心肌缺血和缺血性心力衰竭。之所以把冠心病分类两大类，是因为其两者的临床表现及预后、治疗手段均不相同，这是因为两者的病理生理、病理解剖学不同所导致。比如急性冠脉综合征是因为冠脉内不稳定斑块所导致，而慢性冠脉病的版块则为稳定性或并非斑块所导致。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 161,
                    "label": "无症状性冠心病 也称隐匿性冠心病，包括症状不典型、真正无症状以及有冠心病史但无症状者。人群中，无症状性冠心病的发生率不清。Framingham研究中，约1/4心肌梗死者发病前无临床症状。虽然这些病人无症状但静息或负荷试验时有心肌缺血的心电图改变，包括ST段压低、T波低平或倒置等。病理学检查心肌无明显组织形态学改变。预后与症状性冠心病患者无明显区别，其预后取决于心肌缺血严重性及左室功能受累程度。劳累性心绞痛：常在运动、劳累、情绪激动或其他增加心肌耗氧量时，发生心前区疼痛而在休息或舌下含服硝酸甘油后迅速缓解。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 162,
                    "label": "心绞痛型冠心病 患者临床上有心肌缺血引起的发作性心前区疼痛病理学检查心肌无组织形态改变。参照世界卫生组织的“缺血性心脏病的命名法及诊断标准”，结合临床特征将心绞痛分为下列几型。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 163,
                    "label": "初发型心绞痛：亦称新近发生心绞痛即在最近1个月内初次发生劳累性心绞痛；也包括有稳定型心绞痛者，已数月不发作心前区疼痛现再次发作时间未到1个月",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 164,
                    "label": "稳定型心绞痛：反复发作劳累性心绞痛，且性质无明显变化，历时1～3个月心绞痛的频率、程度时限以及诱发疼痛的劳累程度无明显变化，且对硝酸甘油有明显反应。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 165,
                    "label": "恶化型心绞痛：亦称增剧型心绞痛即原为稳定型心绞痛在最近3个月内心绞痛程度和发作频率增加、疼痛时间延长以及诱发因素经常变动，常在低心肌耗氧量时引起心绞痛提示病情进行性恶化。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 166,
                    "label": "自发性心绞痛 心绞痛发作与心肌耗氧量增加无明显关系，疼痛程度较重和时间较长，且不易被舌下含服硝酸甘油所缓解。心电图常出现一过性ST-T波改变，但不伴血清酶变化",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 167,
                    "label": "卧位型心绞痛：常在半夜熟睡时发生，可能因做梦、夜间血压波动或平卧位使静脉回流增加，引起心功能不全，致使冠脉灌注不足和心肌耗氧量增加。严重者可发展为心肌梗死或心性猝死",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 168,
                    "label": "\"变异型心绞痛：通常在昼夜的某一固定时间自发性发作心前区疼痛",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 169,
                    "label": "中间综合征：亦称冠脉功能不全心绞痛状态或梗死前心绞痛患者常在休息或睡眠时自发性发作心绞痛，且疼痛严重，历时可长达30min以上，但无心肌梗死的心电图和血清酶变化。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 170,
                    "label": "梗死后心绞痛：为急性心肌梗死发生后1～3个月内重新出现的自发性心绞痛。通常是梗死相关的冠脉发生再通(不完全阻塞)或侧支循环形成，致使“不完全梗阻”尚存活但缺血的心肌导致心绞痛。也可由多支冠脉病变引起梗死后心绞痛。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 171,
                    "label": "混合性心绞痛 休息和劳累时均发生心绞痛，常由于冠脉一处或多处严重狭窄，使冠脉血流突然和短暂减少所致。后者可能是由于一大段心外膜冠脉过度敏感、内膜下粥样硬化斑块处张力增加、血小板血栓暂时阻塞血管、血管收缩和阻塞合并存在和小血管处血管张力变化。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 172,
                    "label": "心肌梗死型冠心病 为冠心病的严重临床表现类型。其基本病因是在冠脉粥样硬化病变基础上发生斑块破裂、出血，血管痉挛，血小板黏附、聚集，凝血因子参与，致血栓形成和血管腔阻塞，引起心肌缺血性坏死。临床表现有持久的心前区剧烈疼痛伴有典型心电图和血清酶浓度序列改变。根据心电图表现，可将急性心肌梗死分成穿壁性、Q波心梗和内膜下非穿壁性、无Q波心梗。前者表现为异常持久的病理性Q波或QS波以及ST段线性背向上抬高。后者表现为无病理性Q波但有ST段抬高或压低和T波倒置。有时心前区疼痛可很轻微甚至缺如，而以其他症状为主要表现如心衰、休克晕厥、心律失常等。在急性心肌梗死恢复期，某些患者可呈现自发性胸痛，有时伴有心电图改变，如伴血清酶再度增高，则可能为急性心肌梗死扩展如无新的血清酶变化，其中某些病例可诊断为梗死后综合征，某些为自发性心绞痛。其他方面的诊断方法有助于建立确切诊断。心梗急性期抬高的ST段迅速明显下降或恢复期病理性Q波自行消退，提示梗死有关冠状动脉再通，在心室功能受损较小。相反，急性心肌梗死2周后ST段抬高常示梗死区室壁活动严重异常或梗死区膨出室壁瘤形成。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 173,
                    "label": "心力衰竭和心律失常型冠心病 又称心肌硬化型冠心病。本型冠心病是由于心肌坏死或长期供血不足，使纤维组织增生所致。其临床特点是心脏逐渐增大，发生心力衰竭和心律失常，通常被称为缺血性心肌病。必须指出，绝大多数缺血型心肌病患者有心梗史和心绞痛症状，说明这些患者存在严重冠脉病变。仅极少数患者可无明显的心绞痛症状或心梗史，对这些患者需冠脉造影确诊。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 174,
                    "label": "猝死型冠心病 指自然发生、出乎意料的死亡。世界卫生组织规定发病后6h内死亡者为猝死多数作者主张定为1h，但也有人主张发病后24h内死亡者也归于猝死之列。约半数以上心性猝死是由于冠心病所致。在动脉粥样硬化基础上，发生冠状动脉痉挛或冠状循环阻塞导致急性心肌缺血，造成局部心电不稳定和一过性严重心律失常(特别是心室颤动)。由于本型病人经及时抢救可以存活，故世界卫生组织认为将本型称为“原发性心脏骤停冠心病”为妥。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 175,
                    "label": "并发症 冠心病可有心脏性猝死、心律失常、心力衰竭、心源性休克、缺血性心肌病、二尖瓣脱垂等并发症。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 176,
                    "label": "心脏性猝死：心脏性猝死由冠心病引起最多，占3/4以上在所有冠心病死亡者中50%～70%为猝死。美国Lown报告的流行病学资料显示，每年心脏性猝死者40万，平均每分钟即有1例发生心脏性猝死，其中80%是冠心病引起。不少冠心病患者平时无任何症状，猝死为首发的临床表现约占冠心病猝死的20%左右。在国内一般北方省市的冠心病患病率、猝死率均明显高于南方。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 177,
                    "label": "心律失常：心律失常可以是缺血性心脏病的惟一症状。可以出现各种快速和缓慢性心律失常。但临床多见的冠心病心律失常主要有期前收缩(房性和室性)、心房扑动与心房颤动非持续性室性心动过速及传导系统障碍导致的病态窦房结综合征、不同程度的房室传导阻滞和束支传导阻滞。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 178,
                    "label": "心力衰竭：主要由于冠状动脉粥样硬化狭窄造成的心肌血供长期不足、心肌组织发生营养障碍和萎缩产生散在的或弥漫性心肌纤维化以及心室发生重构所致。患者大多有心肌梗死病史或心绞痛史，逐渐发生心力衰竭，大多先发生左室衰竭然后继以右心衰，为全心衰出现相应的临床症状。　　 　　 ",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 179,
                    "label": "二尖瓣脱垂：二尖瓣脱垂综合征在冠心病中的发病率中较高。理化分析76例，14例(18.4%)临床有此综合征。主要由于供应前外乳头肌或后内乳头肌的动脉狭窄后，产生前外或后内乳头肌供血不足及收缩无能引起。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 180,
                    "label": "诊断方法",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 181,
                    "label": "病史、症状 典型的症状为劳力型心绞痛，在活动或情绪激动时出现心前区压榨性疼痛，部分患者向左肩部或/和左上臂部放散，一般持续5～10分钟，休息或含服硝基甘油等药物可缓解。部分伴有胸闷或以胸闷为主，严重者疼痛较重，持续时间延长，休息或睡眠时也可以发作。病史提问要注意诱因、疼痛的部位、持续时间，有无放散，伴随症状及缓解方式。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 182,
                    "label": "实验室检查 一般早期无明确的阳性体征，较重者可有心界向左下扩大，第一心音减弱，有心律失常时可闻及早搏、心房纤颤等，合并心衰时两下肺可闻及湿罗音，心尖部可闻及奔马律等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 183,
                    "label": "血清高脂蛋白血症的表现(胆固醇、甘油三酯、LDL-C增高)；血糖增高等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 184,
                    "label": "如出现心肌梗死可出现血清心肌酶检查的异常(肌酸激酶、乳酸脱氢酶谷氨酸草酰乙酸转氨酶增高；尤其CK-MB增高；LDH1/LDH2＞1等)有诊断价值。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 185,
                    "label": "心肌梗死时血清肌红蛋白、肌钙蛋白都可增高。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 186,
                    "label": "辅助检查：心电图呈t波低平、倒置及st段下移，特别是水平型和下斜型下移更有意义，b超可有左室室壁节段性运动障碍。平板运动试验常阳性，同位素心肌扫描（ect）可出现心肌缺血性改变，24小时心电图（holter）监测运动时出现缺血性改变，冠状动脉造影是诊断冠心病的金标准，必要时可检查血脂、血糖。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 187,
                    "label": "、心电图 反映心脏的电活动，在临床对冠心病出现的心律失常、心肌缺血、心肌梗死(病变的定位、范围、深度等)诊断有较高的敏感性和重要的诊断意义",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 188,
                    "label": "动态心电图 由于DCG可连续记录24h患者在日常生活中的心电图而不受体位的影响，因此它能够捕捉患者常规心电图不能记录到的短阵心律失常和一过性心肌缺血。对无症状心肌缺血、心绞痛、心律失常的诊断及评价药物疗效具有重要作用。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 189,
                    "label": "心电图运动试验 ，此试验是通过运动增加心脏的负荷，使心脏耗氧量增加。当运动达到一定负荷时，冠状动脉狭窄病人的心肌血流量不随运动量而增加，即出现心肌缺血，在心电图上出现相应的改变对无症状性心肌缺血的诊断；急性心肌梗死的预后评价有意义。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 190,
                    "label": "心脏药物负荷试验， 某些药物如双嘧达莫、腺苷、多巴酚丁胺等可以增快心律，增加心肌的耗氧量或“冠脉窃血”诱发心肌缺血，引起心绞痛或心电图ST段改变。利用这些药物的特性，对疑有冠心病但因年老体弱或生理缺陷等不能做运动试验者进行药物负荷试验，提高诊断率。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 191,
                    "label": "经食管心房调搏负荷试验， 将电极导管置于食管近心脏左心房水平的位置用程控心脏刺激仪发放脉冲起搏心房，使心律加快，从而增加心脏的耗氧量诱发心肌缺血",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 192,
                    "label": "X线胸片 ，可显示继发于心肌缺血和(或)心肌梗死的肺淤血、肺水肿和心脏-左室增大，及对病情判断和预后评估有重要意义对某些机械并发症如心室壁瘤、室间隔穿孔(破裂)以及乳头肌功能失调或断裂诊断也有一定的帮助。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 193,
                    "label": "冠状动脉造影(含左室造影) 目前仍是诊断冠心病，选择冠心病病人手术和介入治疗适应证的可靠方法使用按冠脉解剖构型的导管，经外周动脉将导管插入并送至冠状动脉开口，把造影剂直接注入左、右冠状动脉显示冠脉及其分支的解剖形态、病变部位和病变程度",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 194,
                    "label": "心脏CT、磁共振成像、多层螺旋CT冠状动脉造影 MRI是无创的检查技术，对冠状狭窄(＞50%)和CABG桥血管阻塞的诊断、冠脉狭窄介入治疗适应证的选择以及介入和手术治疗后的随访及其疗效的观察都有初步的和良好的价值。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 195,
                    "label": "超声心动图 是诊断冠心病不可缺少的手段它以简便、无创、重复性好而广泛应用于临床诊断、术中观察、术后及药物治疗评价等方面。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 196,
                    "label": "核素显像 核素心肌灌注显像是筛选冠状动脉造影最有价值的无创性手段。负荷心肌灌注显像阴性基本可排除冠脉病变。单纯心肌缺血，在负荷心肌显像图可见到沿冠脉分布的心肌节段有明显的放射性稀疏(减低)或缺损区，在静息显像图上，该局部有放射性填充，证明此心肌节段为缺血性改变，此类患者应行冠状动脉造影，明确冠脉狭窄的部位、确定治疗方案。此外此检查方法也对心肌梗死、心梗合并室壁瘤的诊断；评估存活心肌、评价血管重建术的疗效和冠心病人预后等也是一项重要的检查手段。 　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 197,
                    "label": "鉴别诊断 冠心病的临床表现比较复杂，故需要鉴别的疾病较多。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 198,
                    "label": "心绞痛型冠心病要与食管疾病(反流性食管炎、食管裂孔疝、弥漫性食管痉挛)；肺、纵隔疾病(肺栓塞自发性气胸及纵隔气肿)及胆绞痛、神经、肌肉和骨骼疾病等鉴别",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 199,
                    "label": "心肌梗死型冠心病要与主动脉夹层、不稳定心绞痛、肺栓塞、急性心包炎急腹症、食管破裂等疾病鉴别。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 200,
                    "label": "治疗 冠心病类型繁多，不同类型治疗不尽相同 增加冠状动脉血供和减少心肌氧耗使心肌供氧和耗氧达到新的平衡，尽最大努力挽救缺血心肌减低病死率。可选用钙通道阻滞剂，硝酸脂类药物，转换酶抑制剂进行治疗，心率较快者可选用β受体阻滞剂，以缓释剂为好。可加用肠溶阿斯匹林100-325mg1/d，注意对冠心病危险因素的治疗如降压治疗、调脂治疗、治疗糖尿病、戒烟、禁酒等。还可选用极化液和硝酸脂类药物静滴。合并心衰及心律失常时需加用纠正心衰及抗心律失常的治疗（详见心衰及心律失常篇），必要时可行冠心病的介入治疗（ptca+支架术），严重者可考虑进行外科搭桥手术。　　",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 201,
                    "label": "冠心病的药物治疗",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 202,
                    "label": "硝酸酯类制剂：其有扩张静脉、舒张动脉血管的作用减低心脏的前、后负荷降低心肌耗氧量；同时使心肌血液重分配有利于缺血区心肌的灌注。代表药为硝酸甘油、硝酸异山梨醇酯等",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 203,
                    "label": "β受体阻滞药：可阻滞过多的儿茶酚胺兴奋β受体，从而减慢心率、减弱心肌收缩力及速度，减低血压，故而达到明显减少心肌耗氧量；此药还可增加缺血区血液供应，改善心肌代谢，抑制血小板功能等，故是各型心绞痛心肌梗死等患者的常用药物。同时β受体阻滞药是目前惟一比较肯定的急性心肌梗死作为二级预防的药物，已证明β受体阻滞药使梗死后存活者的心脏病病死率猝死率与再梗死发生率均降低。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 204,
                    "label": "钙拮抗药：通过非竞争性地阻滞电压敏感的L型钙通道，使钙经细胞膜上的慢通道进入细胞内，即减少钙的内流抑制钙通过心肌和平滑肌膜，从而减低心肌耗氧量、提高心肌效率；减轻心室负荷；直接对缺血心肌起保护作用同时此药可增加缺血区心肌供血、抑制血小板聚集促进内源性一氧化氮的产生及释放等多种药理作用。是目前临床上治疗冠心病的重要药物。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 205,
                    "label": "调脂药、抗凝和抗血小板药：则从发病机制方面着手，达到减慢或减轻粥样硬化的发生和稳定斑块的作用，最终也是使心肌氧供增加。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 206,
                    "label": "其他冠状动脉扩张药：如双密达莫、吗多明、尼可地尔等",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 207,
                    "label": "冠心病的介入治疗",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 208,
                    "label": "经皮冠状动脉腔内成形术 (percutaneous transluminal coronary angi oplastyPTCA )即用经皮穿刺方法送入球囊导管，扩张狭窄冠状动脉的一种心导管治疗技术。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 209,
                    "label": "作用机制：通过球囊在动脉粥样硬化狭窄节段的机械挤压使粥样硬化的血管内膜向外膜伸展，血管直径扩大，或粥样硬化斑块被撕裂沿血管腔延伸，在生理压力和血流冲击下，重新塑形生成新的平滑内腔，并在较长时间内保持血流通畅。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 210,
                    "label": "适应证：",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 211,
                    "label": "早期适应证：稳定性心绞痛及单支血管病变病变特征为孤立、近端、短(＜10mm)，向心性，不累及大分支，无钙化及不完全阻塞，左室功能良好且具有冠状动脉旁路移植术指征对此类病人，作PTCA的成功率高于95%，因并发症须急诊作冠状动脉旁路移植术者少于2%。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 212,
                    "label": "扩展适应证：近年来，随着技术经验的提高和导管、导丝的改进，PRCA适应证在早期适应证的基础上，已得到极大扩展。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 213,
                    "label": "临床适应证：不稳定性心绞痛、冠状动脉旁路移植术后心绞痛、高龄病人(≥75岁)心绞痛、急性心肌梗死、左室功能明显受损(LVEF＜30%)。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 214,
                    "label": "血管适应证：多支血管病变冠状动脉旁路移植术后的血管桥(大隐静脉桥或内乳动脉桥)病变、旁路移植术后的冠状动脉本身病变被保护的左主干病变。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 215,
                    "label": "病变适应证：病变位于血管远端或血管分叉处，长度＞10mm，偏心性、不规则，有钙化、溃疡、血栓等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 216,
                    "label": "1988年ACC/AHA心血管操作技术小组和VTVA专家组总结了过去10年的经验将冠状动脉病变特征分为A、B、C 三型，并提出冠状动脉病变特征与PTCA成功和危险性的相互关系，作为PTCA适应证选择的指南",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 217,
                    "label": "A型病变：冠状动脉每处狭窄段长度＜10mm，呈同心狭窄，病变血管段弯曲度＜45°，管腔光滑，不完全阻塞，导丝和气囊导管易于通过，很轻或没有钙化，病变部分远离血管开口分叉处，无分支血管病变，血管内没有血栓。该型病变PTCA成功率＞85%，危险性低",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 218,
                    "label": "B型病变：冠状动脉呈管状狭窄，长度10～20mm，为偏心性狭窄，近端血管中等弯曲，中等成角(＞45°，＜90°)，管腔不规则中度钙化，完全阻塞＜3个月，狭窄位于血管开口部分，属分叉部位的病变，血管内有血栓存在。此型病变PTCA成功率60%～85%，具有中等危险性。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 219,
                    "label": "C型病变：冠状动脉呈弥漫性、偏心性狭窄长度＞20mm，重度钙化，其近端血管过度扭曲，成角＞90°，完全阻塞＞3个月。病变部分位于血管开口处邻近大血管分支保护有困难，血管内有血栓形成，或有血管桥纤维化。此型病变PTCA成功率＜60%，危险性高。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 220,
                    "label": "护理：a.持续心电监护24～48h，严密观察心律失常、心肌缺血和心肌梗死征兆。b.建立静脉通路，测血压半小时1次，防止低血压发生。c.观察穿刺部位渗血、血肿形成及足背动脉搏动情况",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 221,
                    "label": "用药：a.肝素1000U/h持续静脉点滴18～24h定时监测部分凝血活酶时间(PTT)，并根据PTT来调整肝素用量，要求PTT延长至2～2.5倍，持续24～72h。b.常规服用阿司匹林300mg/d，30天后改为50～100mg/d维持。 c.术后6周～6个月内服用钙拮抗药，以防止冠状动脉扩张处血管痉挛",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 222,
                    "label": "冠状动脉闭塞：冠状动脉闭塞主要由于PTCA术后冠状动脉内膜撕裂、冠状动脉痉挛粥样斑块内膜下出血及血栓形成引起。发生率约5%。位于血管弯曲或分叉处的病变偏心性、长段非孤立性病变＞90%的严重狭窄以及有新鲜血栓部位的扩张易导致急性闭塞。临床可表现为持续性心绞痛、急性心肌梗死心电图示ST段抬高，冠状动脉造影发现血管完全闭塞。PTCA引发的冠状动脉急性闭塞大约一半发生在心导管室，另一半发生在回监护病房之后，二者的处理方法亦有所不同。若冠状动脉急性闭塞发生在术中，首先应立即往冠状动脉内注射硝酸甘油200～300μg，并给予足量肝素，然后推注造影剂，若证实扩张局部有血栓形成，立即往冠状动脉内注入t-PA 20～40mg，速度1mg/min；或尿激酶25万U，15min内注入若病变部位适合安置血管内支架则首选冠状动脉内支架术，以成功地打开血管，支撑和黏合撕裂的内膜。若血管直径≤2.5mm或手头无合适的支架，可选用PTCA，以低压力(3～4个大气压)、长时间(数分钟或更长)重复扩张。若重复扩张失败，则更换灌注球囊导管，再延长扩张时间若发生急性闭塞时导引导丝已撤出冠状动脉则立即选择尖端最软或高度柔软易控的导丝，在造影剂显影下小心送达闭塞部位，重复PTCA，注意导丝切勿进入内膜裂口处若以上措施无效或无法进行，且闭塞发生在主干或主支，应行紧急冠状动脉旁路移植术。若闭塞发生于分支，血流动力学稳定，受累心肌范围小，或该处心肌原已梗死，或有侧支供血则紧急冠状动脉旁路移植术不作首选。对于术后发生的冠状动脉闭塞，则应立即送回导管室行急诊PTCA若原来病变较复杂，PTCA术进行较困难，送回导管室后导丝无法通过闭塞处，经冠状动脉内硝酸甘油解痉及冠状动脉内溶栓治疗无效，宜尽快实施冠状动脉旁路移植术。若导丝和球囊已通过闭塞处但反复扩张效果不佳，则进行冠状动脉内支架术。若不能成功置入支架，则应保留导丝在冠状动脉内，行紧急冠状动脉旁路移植术",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 223,
                    "label": "冠状动脉内膜撕裂和夹层：冠状动脉内膜撕裂即由于明显的内膜损伤而在造影时显示冠状动脉管腔内充盈缺损造影剂向管腔外渗出或管腔内线状密度增高当内膜撕裂导致管腔闭塞或血流受阻而引起持久胸痛、急性心肌梗死或需急诊冠状动脉旁路移植术时称为冠状动脉夹层。冠状动脉内膜撕裂或夹层大多由于球囊扩张时对血管和斑块直接的机械作用力所引起，球囊直径过大时更易发生；少数可由于导引导丝或球囊导管直接从动脉内膜或斑块下方穿通所致，这种情况多见于严重偏心性狭窄进行球囊扩张时当内膜撕裂较血管内径减少＞20%但＜50%时，远端血流充盈正常无心绞痛及心电图ST-T改变，则为轻度内膜撕裂，不需特殊处理但术后须严密观察，充分给予抗凝治疗。若内膜撕裂致血管内径减少＞50%或有造影剂滞留，或形成假腔，远端血流充盈迟缓，伴心绞痛和心电图ST-T改变，则为严重内膜撕裂，须积极处理一般情况下首选冠状动脉内支架术。若病变部位不适合置入支架或手头无合适的支架，应即重复PTCA以低压力(3～5个大气压)，长时间(3～15min)充盈球囊，以黏合撕裂的内膜。重复扩张一般首选原球囊，若不成功，对直血管处病变可换大一号球囊，对血管弯曲处病变或成角病变可改用小一号球囊重复扩张或更换灌注球囊长时间扩张。大血管近端夹层导致大面积急性心肌梗死或缺血，特别是并发低血压、休克，而再次球囊扩张或植入支架不成功时，应立即进行急诊冠状动脉旁路移植术。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 224,
                    "label": "冠状动脉痉挛：PTCA术中可发生冠状动脉痉挛，大部分病人痉挛可由药物缓解，不至于造成不良后果。但有部分病人可发生急性心肌梗死。为预防冠状动脉痉挛的发生，术前应给予钙拮抗药和硝酸酯类。一旦在操作过程中出现冠状动脉痉挛，应向冠状动脉内推注硝酸甘油200～300?g，可重复应用。若反复痉挛，则将冠状动脉灌注球囊导管放至闭塞处，并经此导管行冠状动脉内持续点滴硝酸甘油10～20μg/min。对严重持久的痉挛导致大面积心肌梗死时，应实施急诊冠状动脉旁路移植术。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 225,
                    "label": "冠状动脉栓塞：极少数病人由于术中导管碰撞或加压扩张造成血管内斑块物质脱落，这些斑块物质可阻塞远端冠状动脉引起栓塞。为预防栓塞的发生，术中应充分应用肝素抗凝；在推送导引导丝前进时，尖端应保持游离状态，避免碰撞斑块。一旦发生栓塞。可重新插入球囊导管，扩张栓塞部位，对较严重的冠状动脉栓塞，须行急诊冠状动脉旁路移植术",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 226,
                    "label": "冠状动脉破裂或穿孔：在进行PTCA术中，偶尔由于球囊充气力过大或送入导丝时用力过猛，可穿破冠状动脉，导致心包填塞或冠状动脉瘘。一般易发生于偏心性狭窄的病人一旦发生，常需进行急诊冠状动脉旁路移植术并修复破裂血管。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 227,
                    "label": "心律失常：PTCA术中导管刺激或球囊扩张可引起心律失常。如室性期前收缩、室性心动过速和室颤，发生率约2.3%。术中应严密监测心电情况，其处理同一般心导管检查引起的心律失常，可静脉注射利多卡因或电转复治疗，单纯室性期前收缩也可不予处理导管刺激解除后即可自动消失。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 228,
                    "label": "主要临床表现为：",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 229,
                    "label": "PTCA术后消失或显著减轻的劳累性心绞痛又复发，运动试验再度阳性或运动耐量减低。也有部分再狭窄病人无明显胸痛症状，而造影显示明确的再狭窄征象。再狭窄的发生与高血压、糖尿病偏心性、钙化性、弥漫性、长病变及术后残余狭窄程度有关。较好的病例选择，较长时间的球囊扩张压迫，长期的钙拮抗药及抗血小板药物应用等可降低再狭窄的发生率。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 230,
                    "label": "再狭窄的诊断标准尚不统一，常采用的再狭窄的定义包括：随访造影显示管腔狭窄直径增加30%以上；PTCA所获得的管腔直径的增加丧失50%以上；管腔狭窄直径从PTCA刚结束时的＜50%增加到≥50%，或者与PTCA刚结束时比较，最小管腔直径减少≥0.72mm",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 231,
                    "label": "PTCA后再狭窄的处理应根据病人的具体情况而定通常可再次行PTCA但再次PTCA最好与第一次PTCA相间隔3个月以上，且术终残余狭窄宜＜30%，以减低再次PTCA术后再狭窄发生率冠状动脉内支架术对预防PTCA术后再狭窄有一定功效。对于病变不适宜行PTCA时特别是多支病变、长病变，可考虑实施冠状动脉旁路移植术。对复发后症状和病变较轻者，亦可用药物治疗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 232,
                    "label": "冠状动脉内支架术 系应用多属支架支撑于病变的冠状动脉内壁，使狭窄或塌陷的血管壁向外扩张的技术。支架植入后，可扩张管腔，封闭分离夹层使损伤内膜愈合，减少内皮下胶原组织暴露，减轻血小板骤集，保持冠脉血流通畅，防止血栓形成从而有效防止血管弹性回缩，减少PTCA术终残留狭窄有效处理PTCA术中内膜撕裂和血管闭塞并发症。其作为PTCA的补充手段选择性用于部分病变使PTCA适应证增宽，近期及远期疗效提高且安全性增加。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 233,
                    "label": "急性或亚急性血栓形成：一般发生在安放支架后2～14天，可导致急性心肌梗死甚至死亡，需紧急血管重建，是冠状动脉内支架术最为严重的并发症。其处理一般首选PTCA结合冠脉溶栓术，即用球囊反复扩张病变处结合冠状动脉内局部注入溶栓药物。若不成功，可实施紧急冠状动脉旁路移植术以进行血管重建。为争取时间也可先进行静脉溶栓。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 234,
                    "label": "出血：早期冠脉支架术后常应用抗凝剂以防止支架后血栓形成，因此出血较常见。其预防主要是减少抗凝药物的应用。目前大多数支架均经过肝素表面处理，支架术后可不必长期大量应用抗凝剂，因此出血并发症减少。除此之外，上肢血管入路(肱动脉桡动脉)进行冠状动脉内支架术因易于包扎可明显减少出血。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 235,
                    "label": "\"侧支闭塞：是较常见的并发症。扩张靶部位病变在支架扩张后挤向邻近的边侧支开口或高压扩张后边支开口受到支架丝的挤压是侧支闭塞的主要原因。预防方法是选用缠绕型支架",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 236,
                    "label": "支架脱载：是支架术中最严重的医源性并发症常因支架绑载不牢靠，病变预扩张不完全和导引导管与冠脉口对接不到位所致，可引起冠状动脉栓塞和外周血管的栓塞。取支架比较困难，尤其是透X射线支架较难取出支架脱载处理方法为：保持一根导丝始终在支架内腔，送另一根导丝经支架外壁送达支架远端在体外同时反复顺时针旋转两根导丝，使其在支架远端相互盘绕在一起。然后将导引导管、盘绕在一起的两根导丝及其内夹的支架，一并撤到腹主动脉或髂动脉。若支架顺利进入动脉鞘则将导丝及支架直接撤出体外；若支架不能进入动脉鞘，则用三爪钳，网篮或心肌活检钳将支架固定并撤出体外。支架术的其他并发症同PTCA。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 237,
                    "label": "冠状动脉内旋切术与旋磨术 系使用旋切或旋磨装置将冠状动脉硬化斑块组织从血管壁切下或磨碎通过导管排出体外，从而消除狭窄病变。术后血管内膜面光滑，无撕裂、不易产生血管壁夹层或弹性回缩，血管急性闭塞率低。但手术器械昂贵，技术较复杂，并发症较多，故目前开展医院尚少",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 238,
                    "label": "经皮冠状动脉激光成形术 是通过光导纤维，将高能激光传输至冠状动脉粥样斑块组织，并迅速使之汽化或使分子键断裂，从而消除或缩小斑块体积拓宽管腔，达到改善冠状动脉狭窄或阻塞的目的。与PTCA相比，冠状动脉激光成形术具有更高的治愈率和血管畅通率，术后再狭窄的发生率较低。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 239,
                    "label": "冠状动脉超声血管成形术 是目前较有应用前途的斑块和血栓消融新技术，系应用高强度、低频率超声作为能源消融纤维性和钙化性斑块以及血栓，增加纤维化血管的可扩张性，从而治疗动脉粥样硬化和血栓性阻塞.超声消融血栓和粥样硬化斑块性血管阻塞的作用机制包括：①机械效应。②空穴作用(cavitation)。③声流作用(acoustic streaming)等。其中机械效应是指快速振动(≥200次/s)的超声探头直接作用于钙化的或致密的纤维化动脉血管壁时，超声压力波形会发生变形和共振从而使组织发生变化由于正常血管壁可以避开震动的探头，因此探头的快速小幅度运动(20～150μg)不会损伤正常血管空穴作用可使组织、液体和细胞中形成气泡并随之塌陷，从而产生高速空穴微爆破，导致血栓融解声流作用是指当超声通过可压缩递质如细胞和组织时，可产生辐射压，引起超声声压区内物质的同向运动。不同物质间存在声流速度阶差足够强的速度阶差可产生强应切力并作用于细胞和邻近的膜结构，导致粥样硬化斑块和血栓的溶解从而使血管再通。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 240,
                    "label": "射频热球囊血管成形术 自PTCA开展以来，已成为冠状动脉血管重建的主要方法但PTCA术后急性闭塞和后期再狭窄始终是限制其疗效的主要问题。因此，人们探索用热能作为球囊扩张的辅助措施来增加PTCA的治疗效果。理论上，热能辅助的优点有：减少血管弹性回缩、血管痉挛和气压伤；降低扩张血管中的血栓形成；热缝合(thermal sealing)分离的组织层；通过热坏死影响血管壁的生物学特性抑制新生内膜的形成。这种利用热能辅助进行球囊扩张狭窄的冠状动脉的方法称热球囊血管成形术。该术根据其加热源的不同又分为3种形式：射频热球囊血管成形术；掺钕：钇铝石榴石(Nd：YAG)激光球囊血管成形术；微波热球囊血管成形术其中以射频热球囊血管成形术的临床研究较多。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 241,
                    "label": "冠心病的外科治疗 冠心病的手术治疗主要包括冠状动脉旁路移植术，心脏移植及某些心肌梗死并发症(如室壁瘤，心脏破裂和乳头肌功能不全等)的外科治疗。(1)冠状动脉旁路移植术(CABG)：近20多年来冠心病外科治疗进展迅速，冠状动脉旁路移植术(冠状动脉搭桥术)的开展，为广大缺血病性的心脏病病人带来了福音，它通过将移植血管绕过冠状动脉狭窄部位与其近端吻合可以达到立即恢复和(或)增加缺血心肌的血流量有效地降低心绞痛的发生率，缓解症状，改善心脏功能提高生活质量。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 242,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 243,
                    "label": "手术适应证：心绞痛经内科治疗不能缓解而影响工作和生活，经冠状动脉造影发现其主干或主要分支明显狭窄，以及心肌梗死后某些严重并发症均应视为手术适应证。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 244,
                    "label": "心绞痛：经内科治疗：心绞痛不能缓解应作冠状动脉造影，发现主干或主要分支70%以上狭窄，其远端通畅者视为搭桥的适应证。左冠状动脉主干重度狭窄者容易猝死应急诊手术。前降支、回旋支及右冠状动脉二者以上重要狭窄者，即使心绞痛不重也应视为“搭桥”的适应证。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 245,
                    "label": "急性心肌梗死：急性心肌梗死后6h内急诊“搭桥”可以改善梗死区心肌血运，缩小坏死区的手术危险性已接近择期性手术。急性心肌梗死并心源性休克，首先药物治疗或主动脉内球囊反搏，增加冠状动脉灌注减少心肌坏死，争取时间进行冠状动脉造影，然后进行急诊“搭桥”。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 246,
                    "label": "心肌梗死后心绞痛：心肌梗死后继续出现有心绞痛，说明又有新的心肌缺血区应进行冠状动脉造影，若发现其主干或主要分支明显狭窄者，也是“搭桥”的适应证。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 247,
                    "label": "充血性心力衰竭：过去认为心力衰竭是旁路手术的禁忌证，而目前认识到手术能改善心肌收缩力但严重的心衰病人死亡率高故手术宜选择较轻的进行。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 248,
                    "label": "手术禁忌证：冠心病人有下列病症的不宜进行冠状动脉旁路移植治疗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 249,
                    "label": "严重心肺功能不全者，如左室射血分数明显降低(＜25%～35%)或左室舒张末压增高[＞20～25mmHg(2.66～3.32kPa)]",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 250,
                    "label": "冠状动脉弥漫性病变或狭窄远端侧冠状动脉管径＜1.5mm者。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 251,
                    "label": "脑血管后遗症偏瘫，糖尿病，肥胖症和其他重要脏器严重病变者。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 252,
                    "label": "冠心病二级预防 冠心病二级预防，就是指对已经发生了冠心病的患者早发现、早诊断、早治疗，目的是改善症状、防止病情进展、改善预后，防止冠心病复发。冠心病二级预防的主要措施有两个，一个是寻找和控制危险因素；另一个是可靠持续的药物治疗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 253,
                    "label": "前者具有抗血小板凝集作用，可减少冠脉内血栓形成；后者可改善心脏功能，减少心脏重塑、变形，对合并有高血压、心功能不全者更有帮助",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 254,
                    "label": "若无禁忌症的心梗后患者使用β阻滞剂，可明显降低心梗复发率、改善心功能和减少猝死的发生。控制高血压，对防治冠心病的重要性是众所周知的。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 255,
                    "label": "胆固醇增高是引起冠心病的罪魁祸首，血清胆固醇增高应通过饮食控制和适当服用降脂药如他汀类药(如舒降之、来适可、普拉固等)。戒烟！",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 256,
                    "label": "心梗后的患者应当远离高胆固醇食物，提倡饮食清淡，多吃鱼和蔬菜，少吃肉和蛋。在同等条件下，糖尿病患者的冠心病患病率比血糖正常者要高出2—5倍。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 257,
                    "label": "冠心病患者应学会一些急性冠脉事件的急救知识，如发生心绞痛或出现心梗症状时可含服硝酸甘油和口服阿司匹林等，在医生指导下，适当参加体育锻炼及减肥",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 258,
                    "label": "冠心病有利的食物 在我们的生活中有很多的冠心病患者，冠心病的治疗也是漫长的过程。但是不仅仅是要依靠药物治疗，化学治疗，同样适当的饮食，健康的食品，都对于冠心病有很好的预防和保健作用。对于冠心病预防的食物有玉米、麦芽、蔬菜水果和豆类种种。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 259,
                    "label": "玉米 玉米食品近年来又重新受到人们的青睐，这是因为它富含维生素E、维生素A。玉米胚榨出的玉米油(油食品)，含有大量不饱和脂肪酸，它能清除人体内多 余的胆固醇，并具有预防动脉硬化的作用。所以，食用一些玉米油是很有益处的。此外，每到青玉米上市时，每天吃一只青嫩的清水煮玉米，对中老年(老年食品) 患者都有益处，最好选黄色的玉米，它较白玉米更富含营养。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 260,
                    "label": "麦芽 它是小麦种子发芽后形成的。麦芽含有丰富的蛋白质，其来源丰富，价格便宜。对于心脏病患者的康复来说，麦芽的蛋白质(蛋白质食品)优于其它德智体动 物蛋白。麦芽内含有的甲种生育酚，是维生素(维生素食品)E的组成成分，它能降低血液的粘稠度，进而阻抑动脉粥样硬化的形成。食用麦芽安全，效果好，没有 副作用。有条件的冠心病患者，每天早晨食用一碗鲜麦芽粥，将大有益处。麦乳精里也含有一定量的麦芽，但很多市售麦乳精的糖分比较高，所以要适当饮用。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 261,
                    "label": "蔬菜和水果 有一些品种对冠心病很有益处，如大蒜和洋葱。1975年有人发现，大蒜及其有效成分，对高脂血症有预防作用，吃洋葱和大蒜都可以使血清胆固醇减少，全血凝集时间明显延长。而且洋葱和大蒜可以防止α-脂蛋白下降。A-脂蛋白是一种运载胆固醇的蛋白质，它把动脉内壁的胆固醇带走，送到肝脏里加工处理，α-脂蛋白就像清洁工一样，把血管内壁的胆固醇及时清扫掉。而且研究还发现，大蒜和洋葱，可以提高纤维蛋白溶解活性，纤维蛋白溶解活性降低的人，发生动脉粥样硬化和冠心病的可能性就大。有人将大蒜生吃与熟吃进了对比，发现生大蒜预防冠心病的作用比吃同等的熟大蒜的明显。具有以上预防作用的有效成，由于 加热而受到破坏。吃多少大蒜和洋葱，才能起到预防冠心病的作用呢?有人研究发现，每天服用每公斤体重1克生大蒜，或每公斤体重2克生洋葱即可起到上述预防 作用，如果你的体重是70公斤，你就要每天至少吃70克生大蒜(大蒜食品)或吃140克生洋葱。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 262,
                    "label": "豆类 　　1977年，在意大利的一次动脉粥样硬化国际会议上，斯瑞托尼报告了用大豆蛋白代替动物蛋白，可显著降低高胆固醇血症病人的血浆胆固醇，其总有效率在90%以上。为什么大豆可以降低血浆胆固醇呢?研究发现，大豆含有豆固醇，豆固醇与谷固醇一样，都是植物固醇。摄入植物固醇以后，人体不公不能吸收它，而且还能抑制肠腔中的胆固醇水解，从而减少了胆固醇的浓度。因此，有人主张应用植物固醇来降低血浆胆固醇的浓度。豆类食品，是我国人民熟悉的食物，而且价格较便宜，蛋白质含量丰富，又具有降低血浆胆固醇的作用",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }],
            "links":[
                {
                    "source": 1,
                    "target": 132,
                    "label": "概念"
                }
                ,
                {
                    "source": 2,
                    "target": 133,
                    "label": "概念"
                }
                ,
                {
                    "source": 3,
                    "target": 134,
                    "label": "概念"
                }
                ,
                {
                    "source": 4,
                    "target": 135,
                    "label": "概念"
                }
                ,
                {
                    "source": 5,
                    "target": 136,
                    "label": "概念"
                }
                ,
                {
                    "source": 6,
                    "target": 137,
                    "label": "概念"
                }
                ,
                {
                    "source": 7,
                    "target": 138,
                    "label": "概念"
                }
                ,
                {
                    "source": 8,
                    "target": 139,
                    "label": "概念"
                }
                ,
                {
                    "source": 9,
                    "target": 140,
                    "label": "概念"
                }
                ,
                {
                    "source": 10,
                    "target": 141,
                    "label": "概念"
                }
                ,
                {
                    "source": 11,
                    "target": 142,
                    "label": "概念"
                }
                ,
                {
                    "source": 12,
                    "target": 143,
                    "label": "概念"
                }
                ,
                {
                    "source": 13,
                    "target": 144,
                    "label": "概念"
                }
                ,
                {
                    "source": 14,
                    "target": 145,
                    "label": "概念"
                }
                ,
                {
                    "source": 15,
                    "target": 146,
                    "label": "概念"
                }
                ,
                {
                    "source": 16,
                    "target": 147,
                    "label": "概念"
                }
                ,
                {
                    "source": 17,
                    "target": 148,
                    "label": "概念"
                }
                ,
                {
                    "source": 18,
                    "target": 149,
                    "label": "概念"
                }
                ,
                {
                    "source": 19,
                    "target": 150,
                    "label": "概念"
                }
                ,
                {
                    "source": 20,
                    "target": 151,
                    "label": "概念"
                }
                ,
                {
                    "source": 21,
                    "target": 152,
                    "label": "概念"
                }
                ,
                {
                    "source": 22,
                    "target": 153,
                    "label": "概念"
                }
                ,
                {
                    "source": 23,
                    "target": 154,
                    "label": "概念"
                }
                ,
                {
                    "source": 24,
                    "target": 155,
                    "label": "概念"
                }
                ,
                {
                    "source": 25,
                    "target": 156,
                    "label": "概念"
                }
                ,
                {
                    "source": 26,
                    "target": 157,
                    "label": "概念"
                }
                ,
                {
                    "source": 27,
                    "target": 158,
                    "label": "概念"
                }
                ,
                {
                    "source": 28,
                    "target": 159,
                    "label": "概念"
                }
                ,
                {
                    "source": 29,
                    "target": 160,
                    "label": "概念"
                }
                ,
                {
                    "source": 30,
                    "target": 161,
                    "label": "概念"
                }
                ,
                {
                    "source": 31,
                    "target": 162,
                    "label": "概念"
                }
                ,
                {
                    "source": 32,
                    "target": 163,
                    "label": "概念"
                }
                ,
                {
                    "source": 33,
                    "target": 164,
                    "label": "概念"
                }
                ,
                {
                    "source": 34,
                    "target": 165,
                    "label": "概念"
                }
                ,
                {
                    "source": 35,
                    "target": 166,
                    "label": "概念"
                }
                ,
                {
                    "source": 36,
                    "target": 167,
                    "label": "概念"
                }
                ,
                {
                    "source": 37,
                    "target": 168,
                    "label": "概念"
                }
                ,
                {
                    "source": 38,
                    "target": 169,
                    "label": "概念"
                }
                ,
                {
                    "source": 39,
                    "target": 170,
                    "label": "概念"
                }
                ,
                {
                    "source": 40,
                    "target": 171,
                    "label": "概念"
                }
                ,
                {
                    "source": 41,
                    "target": 172,
                    "label": "概念"
                }
                ,
                {
                    "source": 42,
                    "target": 173,
                    "label": "概念"
                }
                ,
                {
                    "source": 43,
                    "target": 174,
                    "label": "概念"
                }
                ,
                {
                    "source": 44,
                    "target": 175,
                    "label": "概念"
                }
                ,
                {
                    "source": 45,
                    "target": 176,
                    "label": "概念"
                }
                ,
                {
                    "source": 46,
                    "target": 177,
                    "label": "概念"
                }
                ,
                {
                    "source": 47,
                    "target": 178,
                    "label": "概念"
                }
                ,
                {
                    "source": 48,
                    "target": 179,
                    "label": "概念"
                }
                ,
                {
                    "source": 49,
                    "target": 180,
                    "label": "概念"
                }
                ,
                {
                    "source": 50,
                    "target": 181,
                    "label": "概念"
                }
                ,
                {
                    "source": 51,
                    "target": 182,
                    "label": "概念"
                }
                ,
                {
                    "source": 52,
                    "target": 183,
                    "label": "概念"
                }
                ,
                {
                    "source": 53,
                    "target": 184,
                    "label": "概念"
                }
                ,
                {
                    "source": 54,
                    "target": 185,
                    "label": "概念"
                }
                ,
                {
                    "source": 55,
                    "target": 186,
                    "label": "概念"
                }
                ,
                {
                    "source": 56,
                    "target": 187,
                    "label": "概念"
                }
                ,
                {
                    "source": 57,
                    "target": 188,
                    "label": "概念"
                }
                ,
                {
                    "source": 58,
                    "target": 189,
                    "label": "概念"
                }
                ,
                {
                    "source": 59,
                    "target": 190,
                    "label": "概念"
                }
                ,
                {
                    "source": 60,
                    "target": 191,
                    "label": "概念"
                }
                ,
                {
                    "source": 61,
                    "target": 192,
                    "label": "概念"
                }
                ,
                {
                    "source": 62,
                    "target": 193,
                    "label": "概念"
                }
                ,
                {
                    "source": 63,
                    "target": 194,
                    "label": "概念"
                }
                ,
                {
                    "source": 64,
                    "target": 195,
                    "label": "概念"
                }
                ,
                {
                    "source": 65,
                    "target": 196,
                    "label": "概念"
                }
                ,
                {
                    "source": 66,
                    "target": 197,
                    "label": "概念"
                }
                ,
                {
                    "source": 67,
                    "target": 198,
                    "label": "概念"
                }
                ,
                {
                    "source": 68,
                    "target": 199,
                    "label": "概念"
                }
                ,
                {
                    "source": 69,
                    "target": 200,
                    "label": "概念"
                }
                ,
                {
                    "source": 70,
                    "target": 201,
                    "label": "概念"
                }
                ,
                {
                    "source": 71,
                    "target": 202,
                    "label": "概念"
                }
                ,
                {
                    "source": 72,
                    "target": 203,
                    "label": "概念"
                }
                ,
                {
                    "source": 73,
                    "target": 204,
                    "label": "概念"
                }
                ,
                {
                    "source": 74,
                    "target": 205,
                    "label": "概念"
                }
                ,
                {
                    "source": 75,
                    "target": 206,
                    "label": "概念"
                }
                ,
                {
                    "source": 76,
                    "target": 207,
                    "label": "概念"
                }
                ,
                {
                    "source": 77,
                    "target": 208,
                    "label": "概念"
                }
                ,
                {
                    "source": 78,
                    "target": 209,
                    "label": "概念"
                }
                ,
                {
                    "source": 79,
                    "target": 210,
                    "label": "概念"
                }
                ,
                {
                    "source": 80,
                    "target": 211,
                    "label": "概念"
                }
                ,
                {
                    "source": 81,
                    "target": 212,
                    "label": "概念"
                }
                ,
                {
                    "source": 82,
                    "target": 213,
                    "label": "概念"
                }
                ,
                {
                    "source": 83,
                    "target": 214,
                    "label": "概念"
                }
                ,
                {
                    "source": 84,
                    "target": 215,
                    "label": "概念"
                }
                ,
                {
                    "source": 85,
                    "target": 216,
                    "label": "概念"
                }
                ,
                {
                    "source": 86,
                    "target": 217,
                    "label": "概念"
                }
                ,
                {
                    "source": 87,
                    "target": 218,
                    "label": "概念"
                }
                ,
                {
                    "source": 88,
                    "target": 219,
                    "label": "概念"
                }
                ,
                {
                    "source": 89,
                    "target": 220,
                    "label": "概念"
                }
                ,
                {
                    "source": 90,
                    "target": 221,
                    "label": "概念"
                }
                ,
                {
                    "source": 91,
                    "target": 222,
                    "label": "概念"
                }
                ,
                {
                    "source": 92,
                    "target": 223,
                    "label": "概念"
                }
                ,
                {
                    "source": 93,
                    "target": 224,
                    "label": "概念"
                }
                ,
                {
                    "source": 94,
                    "target": 225,
                    "label": "概念"
                }
                ,
                {
                    "source": 95,
                    "target": 226,
                    "label": "概念"
                }
                ,
                {
                    "source": 96,
                    "target": 227,
                    "label": "概念"
                }
                ,
                {
                    "source": 97,
                    "target": 228,
                    "label": "概念"
                }
                ,
                {
                    "source": 98,
                    "target": 229,
                    "label": "概念"
                }
                ,
                {
                    "source": 99,
                    "target": 230,
                    "label": "概念"
                }
                ,
                {
                    "source": 100,
                    "target": 231,
                    "label": "概念"
                }
                ,
                {
                    "source": 101,
                    "target": 232,
                    "label": "概念"
                }
                ,
                {
                    "source": 102,
                    "target": 233,
                    "label": "概念"
                }
                ,
                {
                    "source": 103,
                    "target": 234,
                    "label": "概念"
                }
                ,
                {
                    "source": 104,
                    "target": 235,
                    "label": "概念"
                }
                ,
                {
                    "source": 105,
                    "target": 236,
                    "label": "概念"
                }
                ,
                {
                    "source": 106,
                    "target": 237,
                    "label": "概念"
                }
                ,
                {
                    "source": 107,
                    "target": 238,
                    "label": "概念"
                }
                ,
                {
                    "source": 108,
                    "target": 239,
                    "label": "概念"
                }
                ,
                {
                    "source": 109,
                    "target": 240,
                    "label": "概念"
                }
                ,
                {
                    "source": 110,
                    "target": 241,
                    "label": "概念"
                }
                ,
                {
                    "source": 111,
                    "target": 242,
                    "label": "概念"
                }
                ,
                {
                    "source": 112,
                    "target": 243,
                    "label": "概念"
                }
                ,
                {
                    "source": 113,
                    "target": 244,
                    "label": "概念"
                }
                ,
                {
                    "source": 114,
                    "target": 245,
                    "label": "概念"
                }
                ,
                {
                    "source": 115,
                    "target": 246,
                    "label": "概念"
                }
                ,
                {
                    "source": 116,
                    "target": 247,
                    "label": "概念"
                }
                ,
                {
                    "source": 117,
                    "target": 248,
                    "label": "概念"
                }
                ,
                {
                    "source": 118,
                    "target": 249,
                    "label": "概念"
                }
                ,
                {
                    "source": 119,
                    "target": 250,
                    "label": "概念"
                }
                ,
                {
                    "source": 120,
                    "target": 251,
                    "label": "概念"
                }
                ,
                {
                    "source": 121,
                    "target": 252,
                    "label": "概念"
                }
                ,
                {
                    "source": 122,
                    "target": 253,
                    "label": "概念"
                }
                ,
                {
                    "source": 123,
                    "target": 254,
                    "label": "概念"
                }
                ,
                {
                    "source": 124,
                    "target": 255,
                    "label": "概念"
                }
                ,
                {
                    "source": 125,
                    "target": 256,
                    "label": "概念"
                }
                ,
                {
                    "source": 126,
                    "target": 257,
                    "label": "概念"
                }
                ,
                {
                    "source": 127,
                    "target": 258,
                    "label": "概念"
                }
                ,
                {
                    "source": 128,
                    "target": 259,
                    "label": "概念"
                }
                ,
                {
                    "source": 129,
                    "target": 260,
                    "label": "概念"
                }
                ,
                {
                    "source": 130,
                    "target": 261,
                    "label": "概念"
                }
                ,
                {
                    "source": 131,
                    "target": 262,
                    "label": "概念"
                }
                ,
                {
                    "source": 1,
                    "target": 2,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 3,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 4,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 5,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 6,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 7,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 8,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 9,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 10,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 11,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 12,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 13,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 14,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 15,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 16,
                    "label": "包括"
                }
                ,
                {
                    "source": 16,
                    "target": 17,
                    "label": "包括"
                }
                ,
                {
                    "source": 16,
                    "target": 18,
                    "label": "包括"
                }
                ,
                {
                    "source": 16,
                    "target": 19,
                    "label": "包括"
                }
                ,
                {
                    "source": 16,
                    "target": 20,
                    "label": "包括"
                }
                ,
                {
                    "source": 20,
                    "target": 21,
                    "label": "包括"
                }
                ,
                {
                    "source": 20,
                    "target": 22,
                    "label": "包括"
                }
                ,
                {
                    "source": 20,
                    "target": 23,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 24,
                    "label": "包括"
                }
                ,
                {
                    "source": 24,
                    "target": 25,
                    "label": "包括"
                }
                ,
                {
                    "source": 24,
                    "target": 26,
                    "label": "包括"
                }
                ,
                {
                    "source": 24,
                    "target": 27,
                    "label": "包括"
                }
                ,
                {
                    "source": 24,
                    "target": 28,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 29,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 30,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 31,
                    "label": "包括"
                }
                ,
                {
                    "source": 30,
                    "target": 32,
                    "label": "包括"
                }
                ,
                {
                    "source": 30,
                    "target": 33,
                    "label": "包括"
                }
                ,
                {
                    "source": 30,
                    "target": 34,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 35,
                    "label": "包括"
                }
                ,
                {
                    "source": 35,
                    "target": 36,
                    "label": "包括"
                }
                ,
                {
                    "source": 35,
                    "target": 37,
                    "label": "包括"
                }
                ,
                {
                    "source": 35,
                    "target": 38,
                    "label": "包括"
                }
                ,
                {
                    "source": 35,
                    "target": 39,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 40,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 41,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 42,
                    "label": "包括"
                }
                ,
                {
                    "source": 29,
                    "target": 43,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 44,
                    "label": "包括"
                }
                ,
                {
                    "source": 44,
                    "target": 45,
                    "label": "包括"
                }
                ,
                {
                    "source": 44,
                    "target": 46,
                    "label": "包括"
                }
                ,
                {
                    "source": 44,
                    "target": 47,
                    "label": "包括"
                }
                ,
                {
                    "source": 44,
                    "target": 48,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 49,
                    "label": "包括"
                }
                ,
                {
                    "source": 49,
                    "target": 50,
                    "label": "包括"
                }
                ,
                {
                    "source": 49,
                    "target": 51,
                    "label": "包括"
                }
                ,
                {
                    "source": 51,
                    "target": 52,
                    "label": "包括"
                }
                ,
                {
                    "source": 51,
                    "target": 53,
                    "label": "包括"
                }
                ,
                {
                    "source": 51,
                    "target": 54,
                    "label": "包括"
                }
                ,
                {
                    "source": 49,
                    "target": 55,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 56,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 57,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 58,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 59,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 60,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 61,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 62,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 63,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 64,
                    "label": "包括"
                }
                ,
                {
                    "source": 55,
                    "target": 65,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 66,
                    "label": "包括"
                }
                ,
                {
                    "source": 66,
                    "target": 67,
                    "label": "包括"
                }
                ,
                {
                    "source": 66,
                    "target": 68,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 69,
                    "label": "包括"
                }
                ,
                {
                    "source": 69,
                    "target": 70,
                    "label": "包括"
                }
                ,
                {
                    "source": 70,
                    "target": 71,
                    "label": "包括"
                }
                ,
                {
                    "source": 70,
                    "target": 72,
                    "label": "包括"
                }
                ,
                {
                    "source": 70,
                    "target": 73,
                    "label": "包括"
                }
                ,
                {
                    "source": 70,
                    "target": 74,
                    "label": "包括"
                }
                ,
                {
                    "source": 70,
                    "target": 75,
                    "label": "包括"
                }
                ,
                {
                    "source": 69,
                    "target": 76,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 77,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 78,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 79,
                    "label": "包括"
                }
                ,
                {
                    "source": 79,
                    "target": 80,
                    "label": "包括"
                }
                ,
                {
                    "source": 79,
                    "target": 81,
                    "label": "包括"
                }
                ,
                {
                    "source": 81,
                    "target": 82,
                    "label": "包括"
                }
                ,
                {
                    "source": 81,
                    "target": 83,
                    "label": "包括"
                }
                ,
                {
                    "source": 81,
                    "target": 84,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 85,
                    "label": "包括"
                }
                ,
                {
                    "source": 85,
                    "target": 86,
                    "label": "包括"
                }
                ,
                {
                    "source": 85,
                    "target": 87,
                    "label": "包括"
                }
                ,
                {
                    "source": 85,
                    "target": 88,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 89,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 90,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 91,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 92,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 93,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 94,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 95,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 96,
                    "label": "包括"
                }
                ,
                {
                    "source": 77,
                    "target": 97,
                    "label": "包括"
                }
                ,
                {
                    "source": 97,
                    "target": 98,
                    "label": "包括"
                }
                ,
                {
                    "source": 97,
                    "target": 99,
                    "label": "包括"
                }
                ,
                {
                    "source": 97,
                    "target": 100,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 101,
                    "label": "包括"
                }
                ,
                {
                    "source": 101,
                    "target": 102,
                    "label": "包括"
                }
                ,
                {
                    "source": 101,
                    "target": 103,
                    "label": "包括"
                }
                ,
                {
                    "source": 101,
                    "target": 104,
                    "label": "包括"
                }
                ,
                {
                    "source": 101,
                    "target": 105,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 106,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 107,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 108,
                    "label": "包括"
                }
                ,
                {
                    "source": 76,
                    "target": 109,
                    "label": "包括"
                }
                ,
                {
                    "source": 69,
                    "target": 110,
                    "label": "包括"
                }
                ,
                {
                    "source": 110,
                    "target": 111,
                    "label": "包括"
                }
                ,
                {
                    "source": 111,
                    "target": 112,
                    "label": "包括"
                }
                ,
                {
                    "source": 112,
                    "target": 113,
                    "label": "包括"
                }
                ,
                {
                    "source": 112,
                    "target": 114,
                    "label": "包括"
                }
                ,
                {
                    "source": 112,
                    "target": 115,
                    "label": "包括"
                }
                ,
                {
                    "source": 112,
                    "target": 116,
                    "label": "包括"
                }
                ,
                {
                    "source": 111,
                    "target": 117,
                    "label": "包括"
                }
                ,
                {
                    "source": 117,
                    "target": 118,
                    "label": "包括"
                }
                ,
                {
                    "source": 117,
                    "target": 119,
                    "label": "包括"
                }
                ,
                {
                    "source": 117,
                    "target": 120,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 121,
                    "label": "包括"
                }
                ,
                {
                    "source": 121,
                    "target": 122,
                    "label": "包括"
                }
                ,
                {
                    "source": 121,
                    "target": 123,
                    "label": "包括"
                }
                ,
                {
                    "source": 121,
                    "target": 124,
                    "label": "包括"
                }
                ,
                {
                    "source": 121,
                    "target": 125,
                    "label": "包括"
                }
                ,
                {
                    "source": 121,
                    "target": 126,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 127,
                    "label": "包括"
                }
                ,
                {
                    "source": 127,
                    "target": 128,
                    "label": "包括"
                }
                ,
                {
                    "source": 127,
                    "target": 129,
                    "label": "包括"
                }
                ,
                {
                    "source": 127,
                    "target": 130,
                    "label": "包括"
                }
                ,
                {
                    "source": 127,
                    "target": 131,
                    "label": "包括"
                }
            ]
        }
    }
});