define(function () {
    return {
        data: {
            "nodes": [
                {
                    "id": 1,
                    "label": "食品",
                    "size": 66,
                    "scale": "2.0",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 2,
                    "label": "谷类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 3,
                    "label": "薯类、淀粉及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 4,
                    "label": "干豆类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 5,
                    "label": "蔬菜类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 6,
                    "label": "菌藻类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 7,
                    "label": "水果类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 8,
                    "label": "坚果、种子类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 9,
                    "label": "畜肉类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 10,
                    "label": "禽肉类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 11,
                    "label": "乳类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 12,
                    "label": "蛋类及制品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 13,
                    "label": "鱼虾蟹贝类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 14,
                    "label": "婴幼儿食品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 15,
                    "label": "小吃、甜饼",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 16,
                    "label": "速食食品",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 17,
                    "label": "饮料类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 18,
                    "label": "含酒精饮料",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 19,
                    "label": "糖、蜜饯类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 20,
                    "label": "油脂类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
                ,
                {
                    "id": 21,
                    "label": "调味品类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(85,133,205)"
                }
            ],
            "links":[
                {
                    "source": "1",
                    "target": "2",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "3",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "4",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "5",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "6",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "7",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "8",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "9",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "10",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "11",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "12",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "13",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "14",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "15",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "16",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "17",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "18",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "19",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "20",
                    "label": "包括"
                },
                {
                    "source": "1",
                    "target": "21",
                    "label": "包括"
                }


            ]
        }
    }
});
        // data: {
        //     "nodes": [{
        //         "id": "刘备",
        //         "label": "刘备",
        //         "x": -540,
        //         "y": 188,
        //         "size": 60,
        //         "scale": "1.8",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "曹操",
        //         "label": "曹操",
        //         "x": 452,
        //         "y": -398,
        //         "size": 60,
        //         "scale": "2.0",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "诸葛亮",
        //         "label": "诸葛亮",
        //         "x": -233,
        //         "y": 438,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(32,184,88)"
        //     }, {
        //         "id": "刘协",
        //         "label": "刘协",
        //         "x": -500,
        //         "y": -845,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "孙策",
        //         "label": "孙策",
        //         "x": -1,
        //         "y": 967,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "吕布",
        //         "label": "吕布",
        //         "x": -263,
        //         "y": -585,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "陆逊",
        //         "label": "陆逊",
        //         "x": 112,
        //         "y": 1077,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(228,54,123)"
        //     }, {
        //         "id": "夏侯淳",
        //         "label": "夏侯淳",
        //         "x": 473,
        //         "y": -244,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "司马懿",
        //         "label": "司马懿",
        //         "x": 907,
        //         "y": -179,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "孙权",
        //         "label": "孙权",
        //         "x": 325,
        //         "y": 776,
        //         "size": 60,
        //         "scale": "1.8",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "关羽",
        //         "label": "关羽",
        //         "x": -926,
        //         "y": 363,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "夏侯渊",
        //         "label": "夏侯渊",
        //         "x": 506,
        //         "y": -113,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "张飞",
        //         "label": "张飞",
        //         "x": -817,
        //         "y": 478,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "糜芳",
        //         "label": "糜芳",
        //         "x": -589,
        //         "y": -158,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "袁绍",
        //         "label": "袁绍",
        //         "x": -746,
        //         "y": -713,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "孙坚",
        //         "label": "孙坚",
        //         "x": 96,
        //         "y": 802,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "蔡瑁",
        //         "label": "蔡瑁",
        //         "x": 150,
        //         "y": -735,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "姜维",
        //         "label": "姜维",
        //         "x": -420,
        //         "y": 399,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(32,184,52)"
        //     }, {
        //         "id": "马超",
        //         "label": "马超",
        //         "x": -918,
        //         "y": 14,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "徐庶",
        //         "label": "徐庶",
        //         "x": -72,
        //         "y": -114,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "刘启",
        //         "label": "刘启",
        //         "x": -636,
        //         "y": -1019,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(97,199,219)"
        //     }, {
        //         "id": "庞统",
        //         "label": "庞统",
        //         "x": -764,
        //         "y": -147,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "马良",
        //         "label": "马良",
        //         "x": -371,
        //         "y": 174,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "孟获",
        //         "label": "孟获",
        //         "x": -691,
        //         "y": 598,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "张辽",
        //         "label": "张辽",
        //         "x": 5,
        //         "y": -498,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "张绣",
        //         "label": "张绣",
        //         "x": 739,
        //         "y": -500,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹真",
        //         "label": "曹真",
        //         "x": 478,
        //         "y": -843,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "荀攸",
        //         "label": "荀攸",
        //         "x": 216,
        //         "y": -371,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "刘表",
        //         "label": "刘表",
        //         "x": -226,
        //         "y": -1012,
        //         "size": 60,
        //         "scale": "1.4",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "大乔",
        //         "label": "大乔",
        //         "x": -73,
        //         "y": 1188,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "司马昭",
        //         "label": "司马昭",
        //         "x": 1081,
        //         "y": -8,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "吴国太",
        //         "label": "吴国太",
        //         "x": -36,
        //         "y": 682,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "张苞",
        //         "label": "张苞",
        //         "x": -934,
        //         "y": 682,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "公孙瓒",
        //         "label": "公孙瓒",
        //         "x": -222,
        //         "y": 101,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "甘氏",
        //         "label": "甘氏",
        //         "x": -542,
        //         "y": 593,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "刘禅",
        //         "label": "刘禅",
        //         "x": -538,
        //         "y": 841,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "黄月英",
        //         "label": "黄月英",
        //         "x": -9,
        //         "y": 341,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(32,184,52)"
        //     }, {
        //         "id": "诸葛瑾",
        //         "label": "诸葛瑾",
        //         "x": 43,
        //         "y": 550,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(32,184,52)"
        //     }, {
        //         "id": "马腾",
        //         "label": "马腾",
        //         "x": -1091,
        //         "y": -105,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "刘辩",
        //         "label": "刘辩",
        //         "x": -477,
        //         "y": -1029,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(97,199,219)"
        //     }, {
        //         "id": "糜氏",
        //         "label": "糜氏",
        //         "x": -461,
        //         "y": -154,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "糜竺",
        //         "label": "糜竺",
        //         "x": -630,
        //         "y": -32,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "王允",
        //         "label": "王允",
        //         "x": -591,
        //         "y": -641,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "蒯越",
        //         "label": "蒯越",
        //         "x": 252,
        //         "y": -657,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "张宝",
        //         "label": "张宝",
        //         "x": 1031,
        //         "y": 511,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(250,41,224)"
        //     }, {
        //         "id": "袁谭",
        //         "label": "袁谭",
        //         "x": -862,
        //         "y": -549,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "袁熙",
        //         "label": "袁熙",
        //         "x": -1028,
        //         "y": -485,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "小乔",
        //         "label": "小乔",
        //         "x": -273,
        //         "y": 1100,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "周瑜",
        //         "label": "周瑜",
        //         "x": -74,
        //         "y": 874,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "曹嵩",
        //         "label": "曹嵩",
        //         "x": 683,
        //         "y": -766,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "清河公主",
        //         "label": "清河公主",
        //         "x": 536,
        //         "y": 20,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "夏侯楙",
        //         "label": "夏侯楙",
        //         "x": 586,
        //         "y": 173,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "荀彧",
        //         "label": "荀彧",
        //         "x": 89,
        //         "y": -346,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "司马师",
        //         "label": "司马师",
        //         "x": 1129,
        //         "y": -150,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹仁",
        //         "label": "曹仁",
        //         "x": 309,
        //         "y": -832,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "刘氏",
        //         "label": "刘氏",
        //         "x": 903,
        //         "y": -490,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "卞氏",
        //         "label": "卞氏",
        //         "x": 738,
        //         "y": -18,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹丕",
        //         "label": "曹丕",
        //         "x": 870,
        //         "y": 188,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "蔡氏",
        //         "label": "蔡氏",
        //         "x": -10,
        //         "y": -945,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "魏延",
        //         "label": "魏延",
        //         "x": -330,
        //         "y": -55,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "赵云",
        //         "label": "赵云",
        //         "x": -728,
        //         "y": 338,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "黄忠",
        //         "label": "黄忠",
        //         "x": -772,
        //         "y": 32,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "法正",
        //         "label": "法正",
        //         "x": -892,
        //         "y": 189,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "蒋琬",
        //         "label": "蒋琬",
        //         "x": -468,
        //         "y": 22,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "沙摩柯",
        //         "label": "沙摩柯",
        //         "x": -591,
        //         "y": 415,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "高顺",
        //         "label": "高顺",
        //         "x": -309,
        //         "y": -412,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "陈宫",
        //         "label": "陈宫",
        //         "x": -146,
        //         "y": -720,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "黄祖",
        //         "label": "黄祖",
        //         "x": -51,
        //         "y": -1148,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "文聘",
        //         "label": "文聘",
        //         "x": -243,
        //         "y": -1173,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "张角",
        //         "label": "张角",
        //         "x": 969,
        //         "y": 651,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(250,41,224)"
        //     }, {
        //         "id": "丁奉",
        //         "label": "丁奉",
        //         "x": 259,
        //         "y": 946,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "徐盛",
        //         "label": "徐盛",
        //         "x": 688,
        //         "y": 807,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "鲁肃",
        //         "label": "鲁肃",
        //         "x": 426,
        //         "y": 619,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "张昭",
        //         "label": "张昭",
        //         "x": 580,
        //         "y": 533,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "蒋钦",
        //         "label": "蒋钦",
        //         "x": 480,
        //         "y": 1044,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "太史慈",
        //         "label": "太史慈",
        //         "x": 460,
        //         "y": 892,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "周泰",
        //         "label": "周泰",
        //         "x": 541,
        //         "y": 741,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "凌统",
        //         "label": "凌统",
        //         "x": 286,
        //         "y": 486,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "吕蒙",
        //         "label": "吕蒙",
        //         "x": 617,
        //         "y": 940,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "甘宁",
        //         "label": "甘宁",
        //         "x": 668,
        //         "y": 650,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "黄盖",
        //         "label": "黄盖",
        //         "x": 324,
        //         "y": 1086,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "韩当",
        //         "label": "韩当",
        //         "x": 442,
        //         "y": 461,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "程普",
        //         "label": "程普",
        //         "x": 217,
        //         "y": 628,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(69,128,97)"
        //     }, {
        //         "id": "郭嘉",
        //         "label": "郭嘉",
        //         "x": 578,
        //         "y": -547,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "徐晃",
        //         "label": "徐晃",
        //         "x": 775,
        //         "y": -638,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "乐进",
        //         "label": "乐进",
        //         "x": 640,
        //         "y": -355,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "张郃",
        //         "label": "张郃",
        //         "x": 659,
        //         "y": -149,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "许褚",
        //         "label": "许褚",
        //         "x": 304,
        //         "y": -213,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "典韦",
        //         "label": "典韦",
        //         "x": 143,
        //         "y": -201,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "贾诩",
        //         "label": "贾诩",
        //         "x": 342,
        //         "y": -520,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "程昱",
        //         "label": "程昱",
        //         "x": 159,
        //         "y": -529,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "于禁",
        //         "label": "于禁",
        //         "x": 565,
        //         "y": -692,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "邓艾",
        //         "label": "邓艾",
        //         "x": 768,
        //         "y": -241,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "钟会",
        //         "label": "钟会",
        //         "x": 370,
        //         "y": -12,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "庞德",
        //         "label": "庞德",
        //         "type": "default",
        //         "x": 241,
        //         "y": -72,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "马谡",
        //         "label": "马谡",
        //         "x": -294,
        //         "y": 285,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "关平",
        //         "label": "关平",
        //         "x": -1045,
        //         "y": 551,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "诸葛瞻",
        //         "label": "诸葛瞻",
        //         "x": -372,
        //         "y": 727,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "孙尚香",
        //         "label": "孙尚香",
        //         "x": -313,
        //         "y": 537,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "孙氏",
        //         "label": "孙氏",
        //         "x": -107,
        //         "y": 1080,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(228,54,123)"
        //     }, {
        //         "id": "貂蝉",
        //         "label": "貂蝉",
        //         "x": -487,
        //         "y": -506,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "董卓",
        //         "label": "董卓",
        //         "x": -415,
        //         "y": -699,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "邹氏",
        //         "label": "邹氏",
        //         "x": 812,
        //         "y": -383,
        //         "size": 60,
        //         "scale": "1.3",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "关兴",
        //         "label": "关兴",
        //         "x": -1137,
        //         "y": 308,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "卢植",
        //         "label": "卢植",
        //         "x": -730,
        //         "y": 183,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "黄承彦",
        //         "label": "黄承彦",
        //         "x": 170,
        //         "y": 265,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(32,184,52)"
        //     }, {
        //         "id": "公孙越",
        //         "label": "公孙越",
        //         "x": -27,
        //         "y": 107,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "韩遂",
        //         "label": "韩遂",
        //         "x": -1213,
        //         "y": -17,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "刘胜",
        //         "label": "刘胜",
        //         "x": -772,
        //         "y": -923,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(97,199,219)"
        //     }, {
        //         "id": "庞德公",
        //         "label": "庞德公",
        //         "x": -855,
        //         "y": -323,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "祝融",
        //         "label": "祝融",
        //         "x": -746,
        //         "y": 848,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(185,35,193)"
        //     }, {
        //         "id": "孙韶",
        //         "label": "孙韶",
        //         "x": -302,
        //         "y": 959,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(36,214,45)"
        //     }, {
        //         "id": "丁原",
        //         "label": "丁原",
        //         "x": -272,
        //         "y": -806,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "张梁",
        //         "label": "张梁",
        //         "x": 1109,
        //         "y": 374,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(250,41,224)"
        //     }, {
        //         "id": "袁术",
        //         "label": "袁术",
        //         "x": -927,
        //         "y": -722,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "袁尚",
        //         "label": "袁尚",
        //         "x": -1125,
        //         "y": -359,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(18,160,144)"
        //     }, {
        //         "id": "吕伯奢",
        //         "label": "吕伯奢",
        //         "x": 759,
        //         "y": -958,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹爽",
        //         "label": "曹爽",
        //         "x": 450,
        //         "y": -1080,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "司马炎",
        //         "label": "司马炎",
        //         "x": 1160,
        //         "y": 144,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹纯",
        //         "label": "曹纯",
        //         "x": 225,
        //         "y": -1074,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "曹昂",
        //         "label": "曹昂",
        //         "x": 415,
        //         "y": -677,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {
        //         "id": "超昂",
        //         "label": "超昂",
        //         "x": 1113,
        //         "y": -468,
        //         "size": 60,
        //         "scale": "1.2",
        //         "color": "rgb(232,19,15)"
        //     }, {"id": "曹植", "label": "曹植", "x": 874, "y": 352, "size": 60, "scale": "1.2", "color": "rgb(232,19,15)"}],
        //     "links": [{"source": "关羽", "target": "刘备", "label": "义弟"}, {
        //         "source": "张飞",
        //         "target": "刘备",
        //         "label": "义弟"
        //     }, {"source": "关羽", "target": "张飞", "label": "义兄"}, {
        //         "source": "张苞",
        //         "target": "张飞",
        //         "label": "儿子"
        //     }, {"source": "关兴", "target": "关羽", "label": "儿子"}, {
        //         "source": "关平",
        //         "target": "张苞",
        //         "label": "结拜"
        //     }, {"source": "关平", "target": "关羽", "label": "义子"}, {
        //         "source": "卢植",
        //         "target": "刘备",
        //         "label": "师傅"
        //     }, {"source": "公孙瓒", "target": "刘备", "label": "朋友"}, {
        //         "source": "甘氏",
        //         "target": "刘备",
        //         "label": "妻"
        //     }, {"source": "刘禅", "target": "甘氏", "label": "儿子"}, {
        //         "source": "诸葛瞻",
        //         "target": "刘禅",
        //         "label": "女婿"
        //     }, {"source": "诸葛瞻", "target": "诸葛亮", "label": "儿子"}, {
        //         "source": "诸葛亮",
        //         "target": "姜维",
        //         "label": "师傅"
        //     }, {"source": "刘备", "target": "诸葛亮", "label": "主公"}, {
        //         "source": "黄月英",
        //         "target": "诸葛亮",
        //         "label": "妻"
        //     }, {"source": "黄承彦", "target": "黄月英", "label": "父亲"}, {
        //         "source": "诸葛瑾",
        //         "target": "诸葛亮",
        //         "label": "哥哥"
        //     }, {"source": "公孙越", "target": "公孙瓒", "label": "弟弟"}, {
        //         "source": "刘备",
        //         "target": "马超",
        //         "label": "主公"
        //     }, {"source": "马腾", "target": "马超", "label": "父亲"}, {
        //         "source": "韩遂",
        //         "target": "马腾",
        //         "label": "结拜"
        //     }, {"source": "刘备", "target": "徐庶", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "徐庶",
        //         "label": "主公"
        //     }, {"source": "刘胜", "target": "刘启", "label": "儿子"}, {
        //         "source": "刘辩",
        //         "target": "刘启",
        //         "label": "同族"
        //     }, {"source": "刘备", "target": "姜维", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "诸葛瑾",
        //         "label": "主公"
        //     }, {"source": "孙尚香", "target": "刘备", "label": "妾"}, {
        //         "source": "糜氏",
        //         "target": "刘备",
        //         "label": "妾"
        //     }, {"source": "糜芳", "target": "糜氏", "label": "哥哥"}, {
        //         "source": "糜竺",
        //         "target": "糜芳",
        //         "label": "哥哥"
        //     }, {"source": "刘备", "target": "糜芳", "label": "主公"}, {
        //         "source": "刘备",
        //         "target": "糜竺",
        //         "label": "主公"
        //     }, {"source": "刘备", "target": "魏延", "label": "主公"}, {
        //         "source": "刘备",
        //         "target": "赵云",
        //         "label": "主公"
        //     }, {"source": "刘备", "target": "黄忠", "label": "主公"}, {
        //         "source": "刘备",
        //         "target": "庞统",
        //         "label": "主公"
        //     }, {"source": "刘备", "target": "法正", "label": "主公"}, {
        //         "source": "刘备",
        //         "target": "蒋琬",
        //         "label": "主公"
        //     }, {"source": "刘备", "target": "马良", "label": "主公"}, {
        //         "source": "刘备",
        //         "target": "孟获",
        //         "label": "主公"
        //     }, {"source": "刘备", "target": "沙摩柯", "label": "主公"}, {
        //         "source": "庞德公",
        //         "target": "庞统",
        //         "label": "叔叔"
        //     }, {"source": "马谡", "target": "马良", "label": "弟弟"}, {
        //         "source": "祝融",
        //         "target": "孟获",
        //         "label": "妻"
        //     }, {"source": "孙韶", "target": "孙策", "label": "儿子"}, {
        //         "source": "孙氏",
        //         "target": "陆逊",
        //         "label": "妻"
        //     }, {"source": "孙氏", "target": "孙策", "label": "女儿"}, {
        //         "source": "刘协",
        //         "target": "刘辩",
        //         "label": "让位"
        //     }, {"source": "董卓", "target": "刘协", "label": "臣"}, {
        //         "source": "王允",
        //         "target": "刘协",
        //         "label": "臣"
        //     }, {"source": "貂蝉", "target": "王允", "label": "义女"}, {
        //         "source": "貂蝉",
        //         "target": "吕布",
        //         "label": "妾"
        //     }, {"source": "丁原", "target": "吕布", "label": "义父"}, {
        //         "source": "董卓",
        //         "target": "吕布",
        //         "label": "义父"
        //     }, {"source": "吕布", "target": "高顺", "label": "主公"}, {
        //         "source": "吕布",
        //         "target": "陈宫",
        //         "label": "主公"
        //     }, {"source": "吕布", "target": "张辽", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "张辽",
        //         "label": "主公"
        //     }, {"source": "刘表", "target": "刘协", "label": "同族"}, {
        //         "source": "蔡氏",
        //         "target": "刘表",
        //         "label": "妻"
        //     }, {"source": "蔡瑁", "target": "蔡氏", "label": "弟弟"}, {
        //         "source": "蒯越",
        //         "target": "蔡瑁",
        //         "label": "朋友"
        //     }, {"source": "曹操", "target": "蒯越", "label": "主公"}, {
        //         "source": "刘表",
        //         "target": "黄祖",
        //         "label": "主公"
        //     }, {"source": "刘表", "target": "文聘", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "蔡瑁",
        //         "label": "主公"
        //     }, {"source": "张宝", "target": "张角", "label": "弟弟"}, {
        //         "source": "张梁",
        //         "target": "张宝",
        //         "label": "弟弟"
        //     }, {"source": "袁绍", "target": "刘协", "label": "诸侯"}, {
        //         "source": "袁术",
        //         "target": "袁绍",
        //         "label": "弟弟"
        //     }, {"source": "袁谭", "target": "袁绍", "label": "儿子"}, {
        //         "source": "袁熙",
        //         "target": "袁谭",
        //         "label": "弟弟"
        //     }, {"source": "袁尚", "target": "袁熙", "label": "弟弟"}, {
        //         "source": "孙尚香",
        //         "target": "吴国太",
        //         "label": "女儿"
        //     }, {"source": "吴国太", "target": "孙坚", "label": "妻"}, {
        //         "source": "孙策",
        //         "target": "孙坚",
        //         "label": "儿子"
        //     }, {"source": "孙权", "target": "孙策", "label": "弟弟"}, {
        //         "source": "大乔",
        //         "target": "孙策",
        //         "label": "妾"
        //     }, {"source": "小乔", "target": "大乔", "label": "妹妹"}, {
        //         "source": "周瑜",
        //         "target": "小乔",
        //         "label": "夫"
        //     }, {"source": "孙权", "target": "周瑜", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "陆逊",
        //         "label": "主公"
        //     }, {"source": "大乔", "target": "陆逊", "label": "岳母"}, {
        //         "source": "孙权",
        //         "target": "丁奉",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "徐盛", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "鲁肃",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "张昭", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "蒋钦",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "太史慈", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "周泰",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "凌统", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "吕蒙",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "甘宁", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "黄盖",
        //         "label": "主公"
        //     }, {"source": "孙权", "target": "韩当", "label": "主公"}, {
        //         "source": "孙权",
        //         "target": "程普",
        //         "label": "主公"
        //     }, {"source": "曹嵩", "target": "曹操", "label": "父亲"}, {
        //         "source": "吕伯奢",
        //         "target": "曹嵩",
        //         "label": "结拜"
        //     }, {"source": "邹氏", "target": "曹操", "label": "妾"}, {
        //         "source": "邹氏",
        //         "target": "张绣",
        //         "label": "嫂子"
        //     }, {"source": "曹操", "target": "张绣", "label": "主公"}, {
        //         "source": "清河公主",
        //         "target": "曹操",
        //         "label": "女儿"
        //     }, {"source": "夏侯楙", "target": "清河公主", "label": "夫"}, {
        //         "source": "夏侯渊",
        //         "target": "夏侯楙",
        //         "label": "父亲"
        //     }, {"source": "夏侯渊", "target": "夏侯淳", "label": "堂弟"}, {
        //         "source": "曹操",
        //         "target": "夏侯淳",
        //         "label": "同族"
        //     }, {"source": "曹操", "target": "夏侯淳", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "夏侯渊",
        //         "label": "同族"
        //     }, {"source": "曹操", "target": "夏侯渊", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "曹真",
        //         "label": "义父"
        //     }, {"source": "曹爽", "target": "曹真", "label": "儿子"}, {
        //         "source": "曹操",
        //         "target": "郭嘉",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "徐晃", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "乐进",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "张郃", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "许褚",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "典韦", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "荀彧",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "荀攸", "label": "主公"}, {
        //         "source": "荀彧",
        //         "target": "荀攸",
        //         "label": "叔叔"
        //     }, {"source": "曹操", "target": "贾诩", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "司马懿",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "程昱", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "于禁",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "邓艾", "label": "主公"}, {
        //         "source": "曹操",
        //         "target": "钟会",
        //         "label": "主公"
        //     }, {"source": "曹操", "target": "庞德", "label": "主公"}, {
        //         "source": "司马师",
        //         "target": "司马懿",
        //         "label": "儿子"
        //     }, {"source": "司马昭", "target": "司马师", "label": "弟弟"}, {
        //         "source": "司马昭",
        //         "target": "司马懿",
        //         "label": "儿子"
        //     }, {"source": "司马炎", "target": "司马昭", "label": "儿子"}, {
        //         "source": "曹仁",
        //         "target": "曹操",
        //         "label": "同族"
        //     }, {"source": "曹纯", "target": "曹仁", "label": "弟弟"}, {
        //         "source": "曹昂",
        //         "target": "曹操",
        //         "label": "儿子"
        //     }, {"source": "刘氏", "target": "曹操", "label": "妻子"}, {
        //         "source": "超昂",
        //         "target": "刘氏",
        //         "label": "儿子"
        //     }, {"source": "卞氏", "target": "曹操", "label": "妻子"}, {
        //         "source": "曹丕",
        //         "target": "卞氏",
        //         "label": "儿子"
        //     }, {"source": "曹植", "target": "曹丕", "label": "弟弟"}, {
        //         "source": "马谡",
        //         "target": "诸葛亮",
        //         "label": "同事"
        //     }, {"source": "马谡", "target": "刘备", "label": "臣"}, {
        //         "source": "孙坚",
        //         "target": "孙权",
        //         "label": "父亲"
        //     }, {"source": "吴国太", "target": "孙权", "label": "母亲"}]
        // }
        // data: {
        //     "nodes": [{
        //         "id": 1,
        //         "label": "骨质疏松",
        //         "size": 66,
        //         "scale": "2.0",
        //         "color": "rgb(255,0,50)",
        //         "fontColor":"rgb(255,0,0)",
        //         "fillColor":"rgb(255,0,0)"
        //     }
        //         ,
        //         {
        //             "id": 2,
        //             "label": "骨质疏松概念",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 3,
        //             "label": "骨质疏松症状",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 4,
        //             "label": "疼痛、乏力",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 5,
        //             "label": "骨柱变形",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 6,
        //             "label": "骨折",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 7,
        //             "label": "骨质疏松病因",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 8,
        //             "label": "内分泌疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 9,
        //             "label": "结缔组织疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 10,
        //             "label": "慢性肾脏疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 11,
        //             "label": "胃肠疾病和营养性疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 12,
        //             "label": "血液系统疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 13,
        //             "label": "神经肌肉系统疾病",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 14,
        //             "label": "长期制动",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 15,
        //             "label": "器官移植术后",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 16,
        //             "label": "用药所致",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 17,
        //             "label": "骨质疏松类型",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 18,
        //             "label": "原发性",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 19,
        //             "label": "绝经后骨质疏松症(I型)",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 20,
        //             "label": "老年性骨质疏松症(II型)",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 21,
        //             "label": "特发性骨质疏松(包括青少年型)",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 22,
        //             "label": "继发性",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 23,
        //             "label": "骨质疏松的诊断",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 24,
        //             "label": "脆性骨折",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 25,
        //             "label": "骨密度测定",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 26,
        //             "label": "骨密度测定方法",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 27,
        //             "label": "诊断标准",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 28,
        //             "label": "骨密度测定临床指征",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 29,
        //             "label": "骨质疏松症的其它评估(筛查)方法",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 30,
        //             "label": "用药治疗",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 31,
        //             "label": "应尽早着手治疗",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 32,
        //             "label": "不应该忽略存在特定病因的治疗",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 33,
        //             "label": "缓解疼痛的治疗措施应合理选择",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 34,
        //             "label": "应重视基础治疗的有效性、安全性、可行性和经济性",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 35,
        //             "label": "钙剂、维生素D和骨吸收抑制药等3大类药",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 36,
        //             "label": "不宜联合应用2种或更多种骨吸收抑制药",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 37,
        //             "label": "钙剂临床应用",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 38,
        //             "label": "计算方法",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 39,
        //             "label": "药物钙服药时间",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 40,
        //             "label": "提倡应用牛奶供钙",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 41,
        //             "label": "钙剂量大时应该分次服药",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 42,
        //             "label": "维生素D应用的方法",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 43,
        //             "label": "不应该忽略维生素D的2次羟化的临床应用价值",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 44,
        //             "label": "普遍存在维生素D缺乏所致骨钙丢失",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 45,
        //             "label": "应遵从推荐的成人每天维生素D摄入量",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 46,
        //             "label": "注意",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 47,
        //             "label": "饮食保健",
        //             "size": 66,
        //             "scale": "1.9",
        //             "color": "rgb(85,133,205)"
        //         }
        //         ,
        //         {
        //             "id": 48,
        //             "label": "食疗",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 49,
        //             "label": "黄豆猪骨汤",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 50,
        //             "label": "制法",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 51,
        //             "label": "功效",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 52,
        //             "label": "桑葚牛骨汤",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 53,
        //             "label": "制法",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 54,
        //             "label": "功效",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 55,
        //             "label": "虾皮豆腐汤",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 56,
        //             "label": "制法：虾皮洗净后泡发;嫩豆腐切成小方块;加葱花、姜末及料酒，油锅内煸香后加水烧汤。",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 57,
        //             "label": "功效",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 58,
        //             "label": "猪皮续断汤",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 59,
        //             "label": "制法",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 60,
        //             "label": "功效",
        //             "size": 66,
        //             "scale": "1.6",
        //             "color": "rgb(250,63,35)"
        //         }
        //         ,
        //         {
        //             "id": 61,
        //             "label": "适宜食用",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 62,
        //             "label": "宜供应充足的钙质",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 63,
        //             "label": "宜供给足够的蛋白质",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 64,
        //             "label": "宜供给充足的维生素D及C，因其在骨骼代谢上起着重要的调节作用。应多吃新鲜蔬菜，苋菜、雪里蕻、香菜、小白菜，还要多吃水果。",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 65,
        //             "label": "不宜食用",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 66,
        //             "label": "忌激性食品",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 67,
        //             "label": "禁烟酒",
        //             "size": 66,
        //             "scale": "1.7",
        //             "color": "rgb(132,55,225)"
        //         }
        //         ,
        //         {
        //             "id": 68,
        //             "label": "预防护理",
        //             "size": 66,
        //             "scale": "1.8",
        //             "color": "rgb(1,255,136)"
        //         }
        //         ,
        //         {
        //             "id": 69,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 70,
        //             "label": "骨质疏松症(osteoporosis)是一种系统性骨病，其特征是骨量下降和骨的微细结构破坏，表现为骨的脆性增加，因而骨折的危险性大为增加，即使是轻微的创伤或无外伤的情况下也容易发生骨折。骨质疏松症是中老年人最常见的骨骼疾病。骨质疏松症是一种全身性疾病，它的主要特征是骨矿物质含量低下、骨结构破坏、骨强度降低、易发生骨折。疼痛、驼背、身高降低和骨折是骨质疏松症的特征性表现。但有许 多骨质疏松症患者在疾病早期常无明显的感觉。骨质疏松性骨折是脆性骨折，通常在日常负重、活动、弯腰和跌 倒后发生。骨折是骨质疏松症的直接后果，轻者影响机体功能，重则致残甚至致死。常见的骨折部位是腰背部、 髋部和手臂。 骨质疏松症是第四位常见的慢性疾病，也是中老年最常见的骨骼疾病。 骨质疏松症被称为沉默的杀手。骨折是骨质疏松症的严重后果，常是部分骨质疏松症患者的首发症状和就诊原因。预防大于治疗。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 71,
        //             "label": "疼痛、脊柱变形和发生脆性骨折是骨质疏松症最典型的临床表现。但许多骨质疏松症患者早期常无明显的自觉症状，往往在骨折发生后经X线或骨密度检查时才发现已有骨质疏松改变。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 72,
        //             "label": "患者可有腰背酸痛或周身酸痛，负荷增加时疼痛加重或活动受限，严重时翻身、起坐及行走有困难",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 73,
        //             "label": "骨质疏松严重者可有身高缩短和驼背。椎体压缩性骨折会导致胸廓畸形，腹部受压，影响心肺功能等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 74,
        //             "label": "轻度外伤或日常活动后发生骨折为脆性骨折。发生脆性骨折的常见部位为胸、腰椎、髋部、桡、尺骨远端和肱骨近端。其他部位亦可发生骨折。发生过一次脆性骨折后，再次发生骨折的风险明显增加。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 75,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 76,
        //             "label": "糖尿病（1型、2型）、甲状旁腺功能亢进症、库欣综合征（Cushingsyndrome）、性腺功能减退症、甲状腺功能亢进症、垂体泌乳素瘤、腺垂体功能减退症等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 77,
        //             "label": "系统性红斑狼疮、类风湿性关节炎、干燥综合征、皮肌炎、混合性结缔组织病等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 78,
        //             "label": "多种慢性肾脏疾病导致肾性骨营养不良。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 79,
        //             "label": "吸收不良综合征、胃肠大部切除术后、慢性胰腺疾病、慢性肝脏疾患、营养不良症、长期静脉营养支持治疗等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 80,
        //             "label": "白血病、淋巴瘤、多发性骨髓瘤、高雪病和骨髓异常增殖综合征等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 81,
        //             "label": "各种原因所致的偏瘫、截瘫、运动功能障碍、肌营养不良症、僵人综合征和肌强直综合征等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 82,
        //             "label": "如长期卧床或太空旅行。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 83,
        //             "label": "器官受损",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 84,
        //             "label": "糖皮质激素、免疫抑制剂、肝素、抗惊厥药、抗癌药、含铝抗酸剂、甲状腺激素、慢性氟中毒、促性腺激素释放激素类似物（GnRHa）或肾衰用透析液等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 85,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 86,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 87,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 88,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 89,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 90,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 91,
        //             "label": "发生了脆性骨折及(或)骨密度低下，目前尚缺乏直接测定骨强度的临床手段。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 92,
        //             "label": "骨强度下降的最终体现，有过脆性骨折临床上即可诊断骨质疏松症",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 93,
        //             "label": "骨矿密度(BMD)简称骨密度，是目前诊断骨质疏松、预测骨质疏松性骨折风险、监测自然病程以及评价药物干预疗效的最佳定量指标。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 94,
        //             "label": "双能X线吸收法(DXA)是目前国际学术界公认的骨密度检查方法，其测定值作为骨质疏松症的诊断金标准。其他骨密度检查方法如各种单光子(SPA)、单能X线(SXA)、定量计算机断层照相术(QCT，)等根据具体条件也可用于骨质疏松症的诊断参考。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 95,
        //             "label": "\"建议参照世界卫生组织(WHO)推荐的诊断标准。基于DXA测定：骨密度值低于同性别、同种族健康成人的骨峰值不足1个标准差属正常;降低1～2.5个标准差之间为骨量低下(骨量减少);降低程度等于和大于2.5个标准差为骨质疏松;骨密度降低程度符合骨质疏松诊断标准同时伴有一处或多处骨折时为严重骨质疏松。现在也通常用T-Score(T值)表示，即T值≥-1.0为正常，-2.5 <T值<-1.0为骨量减少",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 96,
        //             "label": "①女性65岁以上和男性70岁以上，无其它骨质疏松危险因素;②女性65岁以下和男性70岁以下，有一个或多个骨质疏松危险因素;③有脆性骨折史或(和)脆性骨折家族史的男、女成年人;④各种原因引起的性激素水平低下的男、女成年人;⑤X线摄片已有骨质疏松改变者;⑥接受骨质疏松治疗进行疗效监测者;⑦有影响骨矿代谢的疾病和药物史",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 97,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 98,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 99,
        //             "label": "应尽早着手治疗  理由是完全和部分消失的骨单位(皮质骨的直径0.2mm的柱形骨单位和骨小梁)不能再生，但是变细的骨单位，经过治疗可以恢复原状。因此，逆转已经消失的骨单位(形成骨质疏松症)是不可能的，而早期干预能够预防大多数人的骨质疏松症。女性的围绝经期(45岁)就应该开始治疗。男性往往可以迟10年。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 100,
        //             "label": "不应该忽略存在特定病因的治疗，尤其不应该忽略原发性骨质疏松症和继发性骨质疏松症的重叠存在。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 101,
        //             "label": "缓解疼痛的治疗措施应合理选择  椎体压缩骨折的急性期，缓解疼痛的方法有：止痛药、肌肉松弛剂、热疗、按摩和休息。骨质疏松性骨折或畸形所致痛苦，可以经特殊设计的体育治疗而得到缓解，某些病人可以穿戴保护性胸衣或背部支架。锻炼腹肌和背肌的运动对于多数病人有益。止痛药有引起老年人胃出血的可能。因此，尽可能选择吲哚美辛(消炎痛)栓剂(肛门塞入)和双氯芬酸乳胶剂(外搽)。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 102,
        //             "label": "应重视基础治疗的有效性、安全性、可行性和经济性，如运动、饮牛奶、晒太阳，小心预防跌倒。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 103,
        //             "label": "钙剂、维生素D和骨吸收抑制药等3大类药，已经被FDA批准后全世界广泛应用。对于比较严重的病例，不应该忽略这3种药联合应用的必要性和安全性。钙剂提供骨形成的原料，维生素D促进肠道钙的吸收和抑制骨钙的流失，骨吸收抑制药能够抑制绝经后和老年性骨质疏松症的过快的骨吸收速度。三者联合应用时作用相互协调，比喻为“海陆空联合作战”。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 104,
        //             "label": "不宜联合应用2种或更多种骨吸收抑制药  骨吸收抑制药包括雌激素、雌激素受体调节剂、双磷酸盐、降钙素等4类，常常单独或轮流应用；但是联合2种或多种，而且足量应用时(例如：充足剂量的女性激素替代的同时，应用阿仑膦酸钠(福善美)每天10mg的剂量)，尽管骨密度的增加更加有效，但是尚不了解对于“骨微结构”、“骨脆性”、“骨折发病率”的影响。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 105,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 106,
        //             "label": "国民每天元素钙摄入量为1000mg/d。大多数专家推荐绝经后妇女每天钙的总摄入量为1000～1500mg/d，包括饮食中钙、牛奶中钙和药物补充剂。青春期和青年成人每天摄入钙的最大允许量是1200mg/d。大多数绝经后妇女的饮食摄钙≤350～500mg/d，大约每天400mg每天饮牛奶500ml，能够获得500mg元素钙。因此，重症病人按照每天1500mg补充，药物钙的补充量=1500推荐量-400饮食-500牛奶=600mg元素钙的药物补充量。如果维生素D补充合理，多数病人按照每天100mg元素钙补充是可以的，则药物钙补充量=1000-400-500=100mg药物钙。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 107,
        //             "label": "药物钙服药时间：枸橼酸钙的服药时间可以是胃排空时，但大多数钙剂是碳酸钙，应该餐中服药，在餐中胃酸分泌的条件下，碳酸钙易于解离被吸收。难于证明各种不同的药物钙补充剂之间在临床疗效方面的区别。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 108,
        //             "label": "提倡应用牛奶供钙：牛奶1毫升含1mg钙，提倡1天饮250～500ml。服鲜奶后腹痛、腹泻者，可用递增法刺激肝脏乳糖酶的分泌，以后逐步加量，可以消除腹痛、腹泻。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 109,
        //             "label": "钙剂量大时应该分次服药：这样从大便丢失的钙量较少。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 110,
        //             "label": "维生素D应用的方法",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 111,
        //             "label": "第1步，在肝进行25-羟化酶的羟化，产生25-OH-D。严重肝功能衰竭的患者中仅仅个别人存在25-羟化酶活性不足。所以许多专家认为，不必要在体外把维生素D进行25-羟化酶的羟化。应用1，25-(OH)2D治疗绝经后骨质疏松症存在较大争论。每天0.5μg的1，25-(OH)2D治疗是否优于生理剂量的未羟化的维生素D，尚无结论。第2步，25-OH-D在近曲肾小管进行1-[alpha]羟化酶的羟化，产生1，25-(OH)2D。人们仅仅能够根据肾小球功能障碍(Cre和BUN的升高)推论近曲肾小管羟化酶活性降低。临床上，凡是“肾功能不全”者才不应该应用未羟化的维生素D，而选择每天0.25～0.50μg的1α-D3。1α-D3的制剂有“法能”等，花费明显低于1，25-(0H)2D。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 112,
        //             "label": "在美国，它也是常见病，但常常未能作出诊断。老年人特别容易存在维生素D缺乏，原因是：维生素D摄入减少和肠钙吸收百分比下降，晒太阳减少和皮肤维生素D合成量减少，肾1α-羟化酶缺乏和相应的1，25(OH)2D缺乏，活性维生素D受体的敏感性降低。维生素D促进肠钙吸收，缺乏时钙吸收减少，降低的血钙依靠继发性甲旁亢和骨钙外流进入血而维持血钙正常低限。因此维生素D缺乏或其效应降低能够引起继发性甲旁亢和相应的骨丢失加快。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 113,
        //             "label": "应遵从推荐的成人每天维生素D摄入量：尽管当前推荐维生素D每天摄入量是：19～50岁200U，51～70岁400U，＞70岁600U，但许多专家推荐，19岁以上成人每天维生素D摄入量应该是800U，但是不要长期超过每天1000U。老年男性和女性服用小剂量维生素D(800U/d)和钙能够减少髋部骨折和其他非脊柱骨折。这种剂量从来没有引起维生素D中毒和相应的骨吸收增加。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 114,
        //             "label": "(4)应当注意：维生素D和1，25-(OH)2D增加肠钙吸收所需剂量和它们刺激骨吸收引起骨质疏松所需剂量相比，前者比后者剂量小，但并不小很多。因此，长期较大剂量VitD应用可以引起骨质丢失，加重骨质疏松。长期每天摄入维生素D大于4000U，或者1，25(OH)2D或lα-D3长期每天摄入超过1.5～3.0μg，则能够像过量PTH一样，引起骨钙外流入血，经尿排出，即：过量维生素D类似于甲状旁腺功能亢进，能够促进骨吸收。“钙 VitD’这种最常用、最基础、相当有效的治疗，需要定期监测血钙、尿钙，将血、尿钙控制在正常范围。24h尿钙应控制小于300mg，又大于100mg。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 115,
        //             "label": "饮食保健",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 116,
        //             "label": "食疗",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 117,
        //             "label": "鲜猪骨250克、黄豆100克。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 118,
        //             "label": "黄豆提前用水泡6-8小时;将鲜猪骨洗净，切断，置水中烧开，去除血污;然后将猪骨放入砂锅内，加生姜20克、黄酒200克，食盐适量，加水1000毫升，经煮沸后，用文火煮至骨烂，放入黄豆继续煮至豆烂，即可食用。每日1次，每次200毫升，每周1剂。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 119,
        //             "label": "鲜猪骨含天然钙质、骨胶原等，对骨骼生长有补充作用。黄豆含黄酮甙、钙、铁、磷等，有促进骨骼生长和补充骨中所需的营养。此汤有较好的预防骨骼老化、骨质疏松作用。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 120,
        //             "label": "桑葚25克，牛骨250~500克。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 121,
        //             "label": "将桑葚洗净，加酒、糖少许蒸制。另将牛骨置锅中，水煮，开锅后撇去浮沫，加姜、葱再煮。见牛骨发白时，表明牛骨的钙、磷、骨胶等已溶解到汤中，随即捞出牛骨，加入已蒸制的桑葚，开锅后再去浮沫，调味后即可饮用。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 122,
        //             "label": "桑葚补肝益肾;牛骨含有丰富钙质和胶原蛋白，能促进骨骼生长。此汤能滋阴补血、益肾强筋，尤甚适用于骨质疏松症、更年期综合征等。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 123,
        //             "label": "虾皮豆腐汤",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 124,
        //             "label": "虾皮洗净后泡发;嫩豆腐切成小方块;加葱花、姜末及料酒，油锅内煸香后加水烧汤。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 125,
        //             "label": "虾皮每100克钙含量高达991毫克，豆腐含钙量也较高，常食此汤对缺钙的骨质疏松症有效。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 126,
        //             "label": "鲜猪皮200克，续断50克。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 127,
        //             "label": "取鲜猪皮洗净去毛、去脂、切小块，放入蒸锅内，加生姜15克，黄酒100克，食盐适量;取续断煎浓汁加入锅内，加水适量，文火煮至猪皮烂为度，即可食用。1日1次，分次服。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 128,
        //             "label": "猪皮含丰富的骨胶原蛋白，胶原蛋白对人体的软骨、骨骼及结缔组织都具有重要作用。续断：有强筋健骨、益肝肾等作用。此粥有利于减轻骨质疏松引起的疼痛，延缓骨质疏松的发生。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 129,
        //             "label": "适宜食用",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 130,
        //             "label": "宜供应充足的钙质。要常吃含钙量丰富的食物，如排骨、脆骨、虾皮、海带、发菜、木耳、桶柑、核桃仁等;",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 131,
        //             "label": "宜供给足够的蛋白质，可选用牛奶、鸡蛋、鱼、鸡、瘦肉、豆类及豆制品等;",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 132,
        //             "label": "宜供给充足的维生素D及C，因其在骨骼代谢上起着重要的调节作用。应多吃新鲜蔬菜，苋菜、雪里蕻、香菜、小白菜，还要多吃水果。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 133,
        //             "label": "不宜食用",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 134,
        //             "label": "忌辛辣、过咸、过甜等刺激性食品",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 135,
        //             "label": "暂无数据",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //         ,
        //         {
        //             "id": 136,
        //             "label": "骨质疏松的预防含有两种意义：首先是高危人群的预防，主要是绝经后妇女；其次是普通人群。骨质疏松的危险因素包括：白人和东方人种，消瘦，长期的钙及其他营养素摄入不足，运动少，嗜烟酒及咖啡，卵巢切除术后等.对有这些危险因素的绝经后妇女，如无其他禁忌证，应提倡早期使用雌激素预防。由于骨峰量的不足是成年后骨密度降低和骨质疏松的重要发病因素，故应在青少年甚至婴幼儿期就开始注意饮食的均衡，特别是钙的摄入，必要时口服钙剂(关于钙剂的选择见下述)。青少年期鼓励多运动，面对老年人特别是已有骨量减步或骨质疏松的患者。应注意运动项目的选择和运动量。由于老年人的应急和反应能力降低。故要尽量注意老年人的日常保护，如饭后起立、夜间起床等，以减少跌倒的危险，降低与骨质疏松相关的骨折的发生率。",
        //             "size": 66,
        //             "scale": "1.1",
        //             "color": "rgb(176,66,59)"
        //         }
        //     ],
        //     "links": [
        //         {
        //             "source": 1,
        //             "target": 69,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 2,
        //             "target": 70,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 3,
        //             "target": 71,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 4,
        //             "target": 72,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 5,
        //             "target": 73,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 6,
        //             "target": 74,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 75,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 8,
        //             "target": 76,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 9,
        //             "target": 77,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 10,
        //             "target": 78,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 11,
        //             "target": 79,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 12,
        //             "target": 80,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 13,
        //             "target": 81,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 14,
        //             "target": 82,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 15,
        //             "target": 83,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 16,
        //             "target": 84,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 17,
        //             "target": 85,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 18,
        //             "target": 86,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 19,
        //             "target": 87,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 20,
        //             "target": 88,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 21,
        //             "target": 89,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 22,
        //             "target": 90,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 23,
        //             "target": 91,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 24,
        //             "target": 92,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 25,
        //             "target": 93,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 26,
        //             "target": 94,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 27,
        //             "target": 95,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 28,
        //             "target": 96,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 29,
        //             "target": 97,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 98,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 31,
        //             "target": 99,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 32,
        //             "target": 100,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 33,
        //             "target": 101,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 34,
        //             "target": 102,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 35,
        //             "target": 103,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 36,
        //             "target": 104,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 37,
        //             "target": 105,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 38,
        //             "target": 106,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 39,
        //             "target": 107,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 40,
        //             "target": 108,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 41,
        //             "target": 109,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 42,
        //             "target": 110,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 43,
        //             "target": 111,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 44,
        //             "target": 112,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 45,
        //             "target": 113,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 46,
        //             "target": 114,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 47,
        //             "target": 115,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 48,
        //             "target": 116,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 49,
        //             "target": 117,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 50,
        //             "target": 118,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 51,
        //             "target": 119,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 52,
        //             "target": 120,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 53,
        //             "target": 121,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 54,
        //             "target": 122,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 55,
        //             "target": 123,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 56,
        //             "target": 124,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 57,
        //             "target": 125,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 58,
        //             "target": 126,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 59,
        //             "target": 127,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 60,
        //             "target": 128,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 61,
        //             "target": 129,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 62,
        //             "target": 130,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 63,
        //             "target": 131,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 64,
        //             "target": 132,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 65,
        //             "target": 133,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 66,
        //             "target": 134,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 67,
        //             "target": 135,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 68,
        //             "target": 136,
        //             "label": "概念"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 2,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 3,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 3,
        //             "target": 4,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 3,
        //             "target": 5,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 3,
        //             "target": 6,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 7,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 8,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 9,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 10,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 11,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 12,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 13,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 14,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 15,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 7,
        //             "target": 16,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 17,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 17,
        //             "target": 18,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 18,
        //             "target": 19,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 18,
        //             "target": 20,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 18,
        //             "target": 21,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 17,
        //             "target": 22,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 23,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 23,
        //             "target": 24,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 23,
        //             "target": 25,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 25,
        //             "target": 26,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 26,
        //             "target": 27,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 26,
        //             "target": 28,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 26,
        //             "target": 29,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 30,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 31,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 32,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 33,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 34,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 35,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 36,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 37,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 37,
        //             "target": 38,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 37,
        //             "target": 39,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 37,
        //             "target": 40,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 37,
        //             "target": 41,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 30,
        //             "target": 42,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 42,
        //             "target": 43,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 42,
        //             "target": 44,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 42,
        //             "target": 45,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 42,
        //             "target": 46,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 1,
        //             "target": 47,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 47,
        //             "target": 48,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 48,
        //             "target": 49,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 49,
        //             "target": 50,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 49,
        //             "target": 51,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 48,
        //             "target": 52,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 52,
        //             "target": 53,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 52,
        //             "target": 54,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 48,
        //             "target": 55,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 55,
        //             "target": 56,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 55,
        //             "target": 57,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 48,
        //             "target": 58,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 58,
        //             "target": 59,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 58,
        //             "target": 60,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 47,
        //             "target": 61,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 61,
        //             "target": 62,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 61,
        //             "target": 63,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 61,
        //             "target": 64,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 47,
        //             "target": 65,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 65,
        //             "target": 66,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 65,
        //             "target": 67,
        //             "label": "包括"
        //         }
        //         ,
        //         {
        //             "source": 47,
        //             "target": 68,
        //             "label": "包括"
        //         }]
        // }
//     }
// });