define(function (){
    return {
        data: {
            "nodes": [{
                "id": 1,
                "label": "糖尿病",
                "size": 66,
                "scale": "2.0",
                "color": "rgb(255,0,50)"
            }
                ,
                {
                    "id": 2,
                    "label": "病因",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 3,
                    "label": "遗传因素",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 4,
                    "label": "环境因素",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 5,
                    "label": "病症",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 6,
                    "label": "多尿",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 7,
                    "label": "多饮 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 8,
                    "label": "多食",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 9,
                    "label": "体重下降",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 10,
                    "label": "乏力",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 11,
                    "label": "视力下降 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 12,
                    "label": "检查",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 13,
                    "label": "血糖 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 14,
                    "label": "尿糖 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 15,
                    "label": "尿酮体 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 16,
                    "label": "糖基化血红蛋白（HbA1c）",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 17,
                    "label": "糖化血清蛋白",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 18,
                    "label": "血清胰岛素和C肽水平",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 19,
                    "label": "血脂 糖尿病患者常见血脂异常，在血糖控制不良时尤为明显",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 20,
                    "label": "免疫指标 胰岛细胞抗体（ICA），胰岛素自身抗体（IAA）和谷氨酸脱羧酶（GAD）抗体是1型糖尿病体液免疫异常的三项重要指标",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 21,
                    "label": "9．尿白蛋白排泄量",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 22,
                    "label": "临床表现",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 23,
                    "label": "典型症状",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 24,
                    "label": "不典型症状",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 25,
                    "label": "急性并发症的表现",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 26,
                    "label": "慢性并发症的表现",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 27,
                    "label": "糖尿病视网膜病变",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 28,
                    "label": "糖尿病性肾病",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 29,
                    "label": "糖尿病神经病变",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 30,
                    "label": "反复的感染",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 31,
                    "label": "糖尿病足",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 32,
                    "label": "诊断",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 33,
                    "label": "肝脏疾病 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 34,
                    "label": "慢性肾功能不全",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 35,
                    "label": "应激状态 ",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 36,
                    "label": "多种内分泌疾病",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 37,
                    "label": "药物治疗",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 38,
                    "label": "双胍类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 39,
                    "label": " 磺脲类",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 40,
                    "label": "苯甲酸衍生物类促泌剂",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 41,
                    "label": "α－糖苷酶抑制剂",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 42,
                    "label": "噻唑烷二酮类（胰岛素增敏剂）",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 43,
                    "label": " 二基肽酶-VI(DPP-VI)抑制剂",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 44,
                    "label": "胰岛素治疗",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 45,
                    "label": "胰岛素的种类 按来源分类",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 46,
                    "label": "按起效时间分成不同类型制剂。",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 47,
                    "label": "短效胰岛素起效快，而作用时间短",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 48,
                    "label": "中效胰岛素",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 49,
                    "label": "预混胰岛素",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 50,
                    "label": "超短效胰岛素类似物",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 51,
                    "label": "长效胰岛素类似物",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 52,
                    "label": "超长效胰岛素类似物",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 53,
                    "label": "胰岛素的起始治疗",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 54,
                    "label": "1 型糖尿病患者需终生胰岛素替代治疗。",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 55,
                    "label": "2 型糖尿病患者经过较大剂量多种口服药物联合治疗后HbA1c 仍大于7.0%时，就可以考虑启动胰岛素治疗。",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 56,
                    "label": "新发病并与1 型糖尿病鉴别困难的消瘦的糖尿病患者，应把胰岛素作为一线治疗药物。",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 57,
                    "label": "在糖尿病病程中出现无明显诱因的体重下降时，应该尽早使用胰岛素治疗。",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 58,
                    "label": "\"特殊情况下胰岛素的应用：初诊糖尿病患者的高血糖",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 59,
                    "label": "胰岛素的用法",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 60,
                    "label": "对于口服降糖药失效或部分失效患者",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 61,
                    "label": "每日早晚两次注射预混胰岛素",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 62,
                    "label": "在上述胰岛素起始治疗的基础上，经过充分的剂量调整",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 63,
                    "label": "胰岛素泵治疗",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 64,
                    "label": "副作用",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 65,
                    "label": "胰高血糖素样肽1(GLP-1)类似物或激动剂",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 66,
                    "label": "糖尿病的手术治疗 2010年中国2型糖尿病防治指南推荐通过腹腔镜操作减肥手术",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 67,
                    "label": "手术方式",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 68,
                    "label": "（1）可调节胃束带术。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(224,111,18)"
                }
                ,
                {
                    "id": 69,
                    "label": "（2）胃旁路术。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(224,111,18)"
                }
                ,
                {
                    "id": 70,
                    "label": "手术适应症主要是肥胖症伴2型糖尿病并符合下列条件者",
                    "size": 66,
                    "scale": "1.5",
                    "color": "rgb(159,190,65)"
                }
                ,
                {
                    "id": 71,
                    "label": "血糖监测",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 72,
                    "label": "糖化血红蛋白（HbA1c）",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 73,
                    "label": "自我血糖监测 自我血糖监测是指糖尿病患者在家中开展的血糖检测，用以了解血糖的控制水平和波动情况，是指导血糖控制达标的重要措施，也是减少低血糖风险的重要手段。",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 74,
                    "label": "自我血糖监测的方案",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 75,
                    "label": "因血糖控制非常差或病情危重而住院治疗者应每天监测4-7次血糖或根据治疗需要监测血糖，直到血糖得到控制。",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 76,
                    "label": "仅采用生活方式干预控制血糖的患者，可根据需要有目的的通过血糖监测了解饮食控制和运动对血糖的影响来调整饮食和运动。",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 77,
                    "label": "使用口服降糖药者可每周监测2-4次空腹或餐后血糖或在就诊前的一周内连续监测三天，每天监测7点血糖（早餐前后、午餐前后、晚餐前后和睡前）。",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 78,
                    "label": "使用胰岛素治疗者可根据胰岛素治疗方案进行相应的血糖监测",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 79,
                    "label": "使用基础胰岛素的患者应监测空腹血糖并根据空腹血糖调整睡前胰岛素的剂量。",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 80,
                    "label": "使用预混胰岛素者应监测空腹和晚餐前血糖并根据晚餐前血糖调整早餐前胰岛素剂量和根据空腹血糖调整晚餐前胰岛素剂量。",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 81,
                    "label": "使用餐时胰岛素者应监测餐后血糖或餐前血糖，并根据餐后血糖和下一餐前血糖调整上一餐前的胰岛素剂量。",
                    "size": 66,
                    "scale": "1.6",
                    "color": "rgb(250,63,35)"
                }
                ,
                {
                    "id": 82,
                    "label": "其他心血管疾病危险因子的监测和控制",
                    "size": 66,
                    "scale": "1.7",
                    "color": "rgb(132,55,225)"
                }
                ,
                {
                    "id": 83,
                    "label": "饮食治疗",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 84,
                    "label": "总热量",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 85,
                    "label": "脂肪",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 86,
                    "label": "碳水化合物",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 87,
                    "label": "蛋白质",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 88,
                    "label": "饮酒",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 89,
                    "label": "食盐",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 90,
                    "label": "饮食指导 ",
                    "size": 66,
                    "scale": "1.9",
                    "color": "rgb(183,1,124)"
                }
                ,
                {
                    "id": 91,
                    "label": "少吃水果",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 92,
                    "label": "不能饮酒",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 93,
                    "label": "少吃高糖多盐食物",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 94,
                    "label": "运动疗法",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 95,
                    "label": "戒烟",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(1,255,136)"
                }
                ,
                {
                    "id": 96,
                    "label": "糖尿病是一种由于胰岛素分泌缺陷或胰岛素作用障碍所致的以高血糖为特征的代谢性疾病。持续高血糖与长期代谢紊乱等可导致全身组织器官，特别是眼、肾、心血管及神经系统的损害及其功能障碍和衰竭。严重者可引起失水，电解质紊乱和酸碱平衡失调等急性并发症酮症酸中毒和高渗昏迷。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 97,
                    "label": "病因",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 98,
                    "label": "1型或2型糖尿病均存在明显的遗传异质性。糖尿病存在家族发病倾向，1/4～1/2患者有糖尿病家族史。临床上至少有60种以上的遗传综合征可伴有糖尿病。1型糖尿病有多个DNA位点参与发病，其中以HLA抗原基因中DQ位点多态性关系最为密切。在2型糖尿病已发现多种明确的基因突变，如胰岛素基因、胰岛素受体基因、葡萄糖激酶基因、线粒体基因等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 99,
                    "label": "进食过多，体力活动减少导致的肥胖是2型糖尿病最主要的环境因素，使具有2型糖尿病遗传易感性的个体容易发病。1型糖尿病患者存在免疫系统异常，在某些病毒如柯萨奇病毒，风疹病毒，腮腺病毒等感染后导致自身免疫反应，破坏胰岛素β细胞。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 100,
                    "label": "糖尿病的症状可分类：一大类是与代谢紊乱有关的表现，尤其是与高血糖有关的“三多一少”，多见于1型糖尿病，2型糖尿病常不十分明显或仅有部分表现，另一大类是各种急性、慢性并发症的表现。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 101,
                    "label": "多尿是由于血糖过高，超过肾糖阈(8.89～10.0mmol/L)，经肾小球滤出的葡萄糖不能完全被肾小管重吸收，形成渗透性利尿，血糖越高，尿糖排泄越多，尿量越多，24h尿量可达5000～10000ml，但老年人和有肾脏疾病者，肾糖阈增高，尿糖排泄障碍，在血糖轻中度增高时，多尿可不明显。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 102,
                    "label": "多饮主要由于高血糖使血浆渗透压明显增高，加之多尿，水分丢失过多，发生细胞内脱水，加重高血糖，使血浆渗透压进一步明显升高，刺激口渴中枢，导致口渴而多饮，多饮进一步加重多尿。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 103,
                    "label": "多食的机制不十分清楚，多数学者倾向是葡萄糖利用率(进出组织细胞前后动静脉血中葡萄糖浓度差)降低所致，正常人空腹时动静脉血中葡萄糖浓度差缩小，刺激摄食中枢，产生饥饿感，摄食后血糖升高，动静脉血中浓度差加大(大于0.829mmoL/L)，摄食中枢受抑制，饱腹中枢兴奋，摄食要求消失，然而糖尿病人由于胰岛素的绝对或相对缺乏或组织对胰岛素不敏感，组织摄取利用葡萄糖能力下降，虽然血糖处于高水平，但动静脉血中葡萄糖的浓度差很小，组织细胞实际上处于“饥饿状态”，从而刺激摄食中枢，引起饥饿，多食，另外，机体不能充分利用葡萄糖，大量葡萄糖从尿中排泄，因此机体实际上处于半饥饿状态，能量缺乏亦引起食欲亢进。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 104,
                    "label": "糖尿病患者尽管食欲和食量正常，甚至增加，但体重下降，主要是由于胰岛素绝对或相对缺乏，机体不能充分利用葡萄糖产生能量，致脂肪和蛋白质分解加强，消耗过多，呈负氮平衡，体重逐渐下降，乃至出现消瘦，一旦糖尿病经合理的治疗，获得良好控制后，体重下降可控制，甚至有所回升，如糖尿病患者在治疗过程中体重持续下降或明显消瘦，提示可能代谢控制不佳或合并其他慢性消耗性疾病。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 105,
                    "label": "乏力在糖尿病患者中亦是常见的，由于葡萄糖不能被完全氧化，即人体不能充分利用葡萄糖和有效地释放出能量，同时组织失水，电解质失衡及负氮平衡等，因而感到全身乏力，精神萎靡。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 106,
                    "label": "不少糖尿病患者在早期就诊时，主诉视力下降或模糊，这主要可能与高血糖导致晶状体渗透压改变，引起晶体屈光度变化所致，早期一般多属功能性改变，一旦血糖获得良好控制，视力可较快恢复正常",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 107,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 108,
                    "label": "血糖 是诊断糖尿病的惟一标准。有明显“三多一少”症状者，只要一次异常血糖值即可诊断。无症状者诊断糖尿病需要两次异常血糖值。可疑者需做75g葡萄糖耐量试验。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 109,
                    "label": "尿糖 常为阳性。血糖浓度超过肾糖阈（160～180毫克/分升）时尿糖阳性。肾糖阈增高时即使血糖达到糖尿病诊断可呈阴性。因此，尿糖测定不作为诊断标准。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 110,
                    "label": "尿酮体 酮症或酮症酸中毒时尿酮体阳性。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 111,
                    "label": "糖基化血红蛋白（HbA1c）是葡萄糖与血红蛋白非酶促反应结合的产物，反应不可逆，HbA1c水平稳定，可反映取血前2个月的平均血糖水平。是判断血糖控制状态最有价值的指标。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 112,
                    "label": "糖化血清蛋白 是血糖与血清白蛋白非酶促反应结合的产物，反映取血前1～3周的平均血糖水平。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 113,
                    "label": "血清胰岛素和C肽水平 反映胰岛β细胞的储备功能。2型糖尿病早期或肥胖型血清胰岛素正常或增高，随着病情的发展，胰岛功能逐渐减退，胰岛素分泌能力下降。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 114,
                    "label": "血脂 糖尿病患者常见血脂异常，在血糖控制不良时尤为明显。表现为甘油三酯、总胆固醇、低密度脂蛋白胆固醇水平升高。高密度脂蛋白胆固醇水平降低。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 115,
                    "label": "免疫指标 胰岛细胞抗体（ICA），胰岛素自身抗体（IAA）和谷氨酸脱羧酶（GAD）抗体是1型糖尿病体液免疫异常的三项重要指标，其中以GAD抗体阳性率高，持续时间长，对1型糖尿病的诊断价值大。在1型糖尿病的一级亲属中也有一定的阳性率，有预测1型糖尿病的意义。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 116,
                    "label": "尿白蛋白排泄量，放免或酶联方法 可灵敏地检出尿白蛋白排出量，早期糖尿病肾病尿白蛋白轻度升高。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 117,
                    "label": "临床表现",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 118,
                    "label": "典型症状：三多一少症状，即多尿、多饮、多食和消瘦。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 119,
                    "label": "不典型症状：一些2型糖尿病患者症状不典型，仅有头昏、乏力等，甚至无症状。有的发病早期或糖尿病发病前阶段，可出现午餐或晚餐前低血糖症状。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 120,
                    "label": "急性并发症的表现：在应激等情况下病情加重。可出现食欲减退、恶心、呕吐、腹痛，多尿加重，头晕、嗜睡、视物模糊、呼吸困难、昏迷等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 121,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 122,
                    "label": "糖尿病视网膜病变：有无视力下降以及下降的程度和时间；是否检查过眼底或眼底荧光造影；是否接受过视网膜光凝治疗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 123,
                    "label": "糖尿病性肾病：有无浮肿，尿中泡沫增多或者蛋白尿。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 124,
                    "label": "糖尿病神经病变：四肢皮肤感觉异常，麻木、针刺、蚁走感。足底踩棉花感，腹泻和便秘交替，尿潴留，半身出汗或时有大汗，性功能障碍。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 125,
                    "label": "反复的感染：例如反复的皮肤感染，如疖、痈，经久不愈的小腿和足部溃疡。反复发生的泌尿系感染，发展迅速的肺结核。女性外阴瘙痒。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 126,
                    "label": "⑤糖尿病足:治疗 糖尿病的治疗包括糖尿病教育、饮食治疗、运动治疗、药物治疗、血糖监测、以及其他心血管疾病危险因子的检测.",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 127,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 128,
                    "label": "肝脏疾病 肝硬化患者常有糖代谢异常，典型者空腹血糖正常或偏低，餐后血糖迅速上升。病程长者空腹血糖也可升高。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 129,
                    "label": "慢性肾功能不全 可出现轻度糖代谢异常。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 130,
                    "label": "应激状态 许多应激状态如心、脑血管意外，急性感染、创伤，外科手术都可能导致血糖一过性升高，应激因素消除后1～2周可恢复。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 131,
                    "label": "4．多种内分泌疾病 如肢端肥大症，库欣综合征、甲亢、嗜铬细胞瘤，胰升糖素瘤可引起继发性糖尿病，除血糖升高外，尚有其他特征性表现，不难鉴别。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 132,
                    "label": "主要口服降糖药物 根据作用机制不同，分为促胰岛素分泌剂（磺脲类、格列奈类）、双胍类、噻唑烷二酮类胰岛素增敏剂、α-糖苷酶抑制剂、二基肽酶-Ⅳ(VDPP-Ⅳ)抑制剂等。药物选择应基于2型糖尿病的两个主要病理生理改变——胰岛素抵抗和胰岛素分泌受损来考虑。此外，患者的血糖波动特点、年龄、体重、重要脏器功能等也是选择药物时要充分考虑的重要因素。联合用药时应采用具有机制互补的药物，以增加疗效、降低不良反应的发生率。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 133,
                    "label": "1．双胍类：此类药物能减少肝糖生成，促进肌肉等外周组织摄取葡萄糖，加速糖的无氧酵解，减少糖在肠道中的吸收。有降脂和减少尿酸作用。适用于2型糖尿病，尤其肥胖者应为首选药物。制剂有①苯乙双胍；②二甲双胍。目前最为常用的是二甲双胍。双胍类药物罕见的严重副作用是诱发乳酸酸中毒。二甲双胍引起者极少，双胍类药物禁用于肾功能不全（血肌酐水平男性>1.5mg/dL，女性>1.4mg/dL或肾小球滤过率<60ml/min/1.73m2）、肝功能不全、严重感染、缺氧或接受大手术的患者。在作造影检查使用碘化造影剂时，应暂时停用二甲双胍。二甲双胍的主要副作用为胃肠道反应。胃肠道症状见于10%病人，可有腹部不适、厌食、恶心、腹泻，偶有口干或金属味。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 134,
                    "label": "2. 磺脲类：此类药物主要作用于胰岛B细胞表面的磺脲类受体，促进胰岛素分泌。适用于胰岛B细胞尚有功能，而无严重肝、肾功能障碍的糖尿病患者磺脲类药物如果使用不当可以导致低血糖，特别是在老年患者和肝、肾功能不全者；磺脲类药物还可以导致体重增加。临床试验显示，磺脲类药物可以使HbA1c降低1%-2%，是目前许多国家和国际组织制定的糖尿病指南中推荐的控制2型糖尿病患者高血糖的主要用药。磺脲类药物有甲苯磺丁脲；格列本脲；格列齐特；格列吡嗪；格列喹酮；格列美脲等。磺脲类药物还有一些缓释和控释剂型，例如格列齐特缓释片，格列吡嗪控释片等。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 135,
                    "label": "苯甲酸衍生物类促泌剂：包括瑞格列奈及那格列奈。本类药物主要通过刺激胰岛素的早期分泌而降低餐后血糖，具有吸收快、起效快和作用时间短的特点，可降低HbA1c 0.3%-1.5%。此类药物需在餐前即刻服用，可单独使用或与其它降糖药物联合应用（磺脲类除外）。格列奈类药物的常见副作用是低血糖和体重增加，但低血糖的发生频率和程度较磺脲类药物轻。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 136,
                    "label": "α－糖苷酶抑制剂：能选择性作用于小肠粘膜刷状缘上的葡萄糖苷酶，抑制多糖及蔗糖分解成葡萄糖，延缓碳水化合物的消化，减少葡萄糖吸收。能改善餐后血糖的高峰。主要包括①阿卡波糖②伏格列波糖等。α-糖苷酶抑制剂可使HbAlc下降0.5%-0.8%，α-糖苷酶抑制剂的常见不良反应为胃肠道反应。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 137,
                    "label": "噻唑烷二酮类（胰岛素增敏剂）：通过激活核受体PPARγ，增强周围组织对胰岛素的敏感性，如增加脂肪组织葡萄糖的吸收和转运，抑制血浆FFA释放，抑制肝糖释放，加强骨骼肌合成葡萄糖等来减轻胰岛素抵抗。适应于以胰岛素抵抗为主的肥胖2型糖尿病。临床试验显示，噻唑烷二酮类药物可以使HbA1c下降1.0%-1.5%。主要包括①罗格列酮；②吡格列酮。体重增加和水肿是噻唑烷二酮类药物的常见副作用。噻唑烷二酮类药物的使用还与骨折和心衰风险增加相关。关于罗格列酮的使用：罗格列酮的安全性问题尚存在争议，其使用在我国受到了较严格的限制。对于未使用过罗格列酮及其复方制剂的糖尿病患者，只能在无法使用其他降糖药或使用其他降糖药无法达到血糖控制目标的情况下，才可考虑使用罗格列酮及其复方制剂。对于已经使用罗格列酮及其复方制剂的患者，应评估心血管疾病风险，在权衡用药利弊后，方可继续用药。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 138,
                    "label": "6. 二基肽酶-VI(DPP-VI)抑制剂：DPP-IV抑制剂通过抑制二肽基肽酶-IV而减少GLP-1在体内的失活，增加GLP-1在体内的水平。GLP-1以葡萄糖浓度依赖的方式增强胰岛素分泌，抑制胰高血糖素分泌。在包括中国2型糖尿病患者在内的临床试验显示西格列汀可降低HbA1c 1.0%。目前国内上市的DPP-IV抑制剂为西格列汀和沙格列汀。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 139,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 140,
                    "label": "胰岛素的种类 按来源分类，有动物胰岛素（猪、牛）和基因重组人胰岛素。人胰岛素的制剂免疫反应较较轻，不易产生抗体。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 141,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 142,
                    "label": "短效胰岛素起效快，而作用时间短。常规属于短效胰岛素。制剂透明。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 143,
                    "label": "中效胰岛素，起效时间，峰值和作用时间皆较短效胰岛长。最常用的是NPH。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 144,
                    "label": "预混胰岛素：50R：50%NPH胰岛素和50%常规胰岛素的混合液； 30R：70%NPH胰岛素和30%正规胰岛素的混合液",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 145,
                    "label": "超短效胰岛素类似物：合成的胰岛素类似物，餐时注射，作用时间短。有赖脯胰岛素和门冬胰岛素两种。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 146,
                    "label": "长效胰岛素类似物：合成的胰岛素类似物，作用时间长，作为基础量胰岛素的补充。如甘精胰岛素和地特胰岛素。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 147,
                    "label": "超长效胰岛素类似物：合成的胰岛素类似物，作用时间更长，例如德谷胰岛素。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 148,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 149,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 150,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 151,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 152,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 153,
                    "label": "围手术期",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 154,
                    "label": "胰岛素的用法：短效胰岛素可用于静脉滴注治疗酮症酸中毒等重症糖尿病。1型糖尿病一经诊断，目前仍需终身皮下胰岛素治疗。2型糖尿病可用胰岛素补充治疗或替代治疗。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 155,
                    "label": "对于口服降糖药失效或部分失效患者，继续使用口服降糖药物，并于睡前皮下注射中效或长效胰岛素，初始剂量为0.1～0.2U/kg，监测血糖，3日后调整剂量，每次调整量在2U-4U。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 156,
                    "label": "每日早晚两次注射预混胰岛素。起始的胰岛素剂量一般为 0.4-0.6 单位/公斤体重/日，按1：1 的比例分配到早餐前和晚餐前。优点是方便，减少午餐前注射的不便利，但午餐血糖波动大，不易控制。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 157,
                    "label": "在上述胰岛素起始治疗的基础上，经过充分的剂量调整，如患者的血糖水平仍未达标或出现反复的低血糖，需进一步优化治疗方案。可以采用餐时+基础胰岛素：根据睡前和三餐前血糖的水平分别调整睡前和三餐前的胰岛素用量。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 158,
                    "label": "胰岛素泵治疗。主要适用人群有：1型糖尿病患者；计划受孕和已孕的糖尿病妇女；需要胰岛素强化治疗的2型糖尿病患者。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 159,
                    "label": "副作用：主要是低血糖反应。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 160,
                    "label": "胰高血糖素样肽1(GLP-1)类似物或激动剂  此类药物通过激动GLP-1受体而发挥降糖作用，并有显著降低体重作用。GLP-1受体激动剂以葡萄糖浓度依赖的方式增强胰岛素分泌、抑制胰高血糖素分泌并能延缓胃排空、和通过中枢性的抑制食欲而减少进食量。可单独使用或与其它口服降糖药物联合使用。在包括中国2型糖尿病患者在内的临床试验显示艾塞那肽可以使HbA1c降低0.5%-1.0%。目前国内上市的GLP-1受体激动剂为艾塞那肽和利拉鲁肽，均需皮下注射。GLP-1受体激动剂的常见胃肠道不良反应，主要见于刚开始治疗时，随治疗时间延长逐渐减少。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 161,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 162,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 163,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 164,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 165,
                    "label": "手术适应症主要是肥胖症伴2型糖尿病并符合下列条件者：（1）BMI≥35kg/m2，伴2型糖尿病；（2）BMI 32-34.9kg/m2，伴2型糖尿病，经过口服药物联合胰岛素治疗6个月以上HbA1c≥7%；（3）年龄在18-60岁之间；（4） 2型糖尿病病程≤5年；(5) 胰岛自身免疫抗体测定阴性，C肽水平不低于0.3mg/L；(6) 无其他腹部手术的禁忌症。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 166,
                    "label": "血糖监测",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 167,
                    "label": "糖化血红蛋白（HbA1c）是评价长期控制血糖的金指标，也是指导临床治疗方案调整的重要依据之一。标准的HbA1c 检测方法的正常值范围为4%-6%，在治疗之初建议每3个月检测1次，一旦达到治疗目标可每3-6个月检查一次。对于患有贫血和血红蛋白异常性疾病的患者，HbA1c的检测结果是不可靠的。可用血糖、糖化血清白蛋白或糖化血清蛋白来评价血糖的控制。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 168,
                    "label": "自我血糖监测 自我血糖监测是指糖尿病患者在家中开展的血糖检测，用以了解血糖的控制水平和波动情况，是指导血糖控制达标的重要措施，也是减少低血糖风险的重要手段。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 169,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 170,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 171,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 172,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 173,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 174,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 175,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 176,
                    "label": "暂无数据",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 177,
                    "label": "其他心血管疾病危险因子的监测和控制 2型糖尿病的治疗除了降糖之外，血压控制、血脂控制和阿司匹林的使用也至关重要。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 178,
                    "label": "饮食治疗 各种类型糖尿病基础治疗的首要措施。饮食治疗的原则是：控制总热量和体重。减少食物中脂肪，尤其是饱和脂肪酸含量，增加食物纤维含量，使食物中碳水化合物、脂肪和蛋白质的所占比例合理。控制膳食总能量的摄入，合理均衡分配各种营养物质。维持合理体重，超重/肥胖患者减少体重的目标是在3-6个月期间体重减轻5%-10%。消瘦患者应通过均衡的营养计划恢复并长期维持理想体重。饮食治疗是各种类型糖尿病治疗的基础，一部分轻型糖尿病患者单用饮食治疗就可控制病情。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 179,
                    "label": "①总热量　总热量的需要量要根据患者的年龄、性别、身高、体重、体力活动量、病情等综合因素来确定。首先要算出每个人的标准体重，可参照下述公式：标准体重（kg）=身高（cm）—105或标准体重（kg）=[身高（cm）—100]×0.9；女性的标准体重应再减去2kg。也可根据年龄、性别、身高查表获得。算出标准体重后再依据每个人日常体力活动情况来估算出每千克标准体重热量需要量。根据标准体重计算出每日所需要热卡量后，还要根据病人的其他情况作相应调整。儿童、青春期、哺乳期、营养不良、消瘦以及有慢性消耗性疾病应酌情增加总热量。肥胖者要严格限制总热量和脂肪含量，给予低热量饮食，每天总热量不超过1500千卡，一般以每月降低0.5～1.0kg为宜，待接近标准体重时，再按前述方法计算每天总热量。另外，年龄大者较年龄小者需要热量少，成年女子比男子所需热量要少一些。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 180,
                    "label": "脂肪：膳食中脂肪所提供的能量不超过总能量的30%，饱和脂肪酸的摄入量不超过总能量的10%。食物中胆固醇摄入量<300mg/日。动物脂肪主要含饱和脂肪酸。植物油中含不饱和脂肪酸多，糖尿病患者易患动脉粥样硬化，应采用植物油为主。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 181,
                    "label": "碳水化合物：膳食中碳水化合物所提供的能量应占总能量的50%-60%。食物中应富含膳食纤维。碳水化合物每克产热4千卡，是热量的主要来源，现认为可用下面公式计算：根据我国人民生活习惯，可进主食（米或面）250～400g，可作如下初步估计，休息者每天主食200～250g，轻度体力劳动者250～300g，中度体力劳动者300～400g，重体力劳动者400g以上。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 182,
                    "label": "肾功能正常者，推荐蛋白质的摄入量占总能量的10%-15%，有显性蛋白尿的患者蛋白摄入量<0.8g/ kg体重/日；从GFR下降起，即应实施低蛋白饮食<0.6g/ kg体重/日，并同时补充复方a-酮酸制剂。蛋白质的需要量在成人每千克体重约1g。在儿童，孕妇，哺乳期妇女，营养不良，消瘦，有消耗性疾病者宜增加至每千克体重1.5～2.0g。糖尿病肾病者应减少蛋白质摄入量，每千克体重0.8g，若已有肾功能不全，应摄入高质量蛋白质，摄入量应进一步减至每千克体重0.6g",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 183,
                    "label": "饮酒: 不推荐糖尿病患者饮酒。每日不超过1-2份标准量（一份标准量为：啤酒350ml，红酒150ml或低度白酒45ml，各约含酒精15g）",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 184,
                    "label": "食盐: 食盐摄入量限制在每天6g以内，高血压患者更应严格限制摄入量。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 185,
                    "label": "\"饮食指导 一般主张每日膳食中的蛋白质，按照0.6-0.8克/公斤标准体重给予，还要在限量范围内提高优质蛋白的比例。处于糖尿病肾病第3、4期的患者，在坚持糖尿病营养治疗其他原则的同时，掌握好每日蛋白质摄入的质和量。糖尿病肾病患者没有给自己制定科学合理的饮食方案，那么一旦肾功能发生障碍，轻则血压上升，周身乏力;重则肾功能障碍，浮肿，男性出现阳萎，睾丸萎缩等;重则完全丧失生活自理能力，甚至有可能被夺去生命",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 186,
                    "label": "\"少吃水果",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 187,
                    "label": "不能饮酒 酒类每克中含14.64千焦（3.5千卡）热量，为高热量食物，有消耗体内热量的作用。过量的酒类可以发生高脂血症或造成代谢紊乱，使肝脏负担加重。糖尿病病人在饮酒时，进食一些碳水化合物的食物，血糖即可升高，使糖尿病失去控制。常饮酒而不吃食物，可抑制肝糖原的分解，使血中葡萄（葡萄食品）糖量减少，出现低血糖（血糖食品）症状。因此，重症糖尿病合并肝胆疾病者，尤其是正在使用胰岛素和口服降血糖药物的患者，要严禁饮酒。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 188,
                    "label": "少吃高糖多盐食物  对于糖尿病的认识，医生们通常是把限制饮食，特别是限制进食含糖高的食品，作为重要的防治方法来指导患者。但是，对限制盐的摄入量则很少引起注意。现代医学研究表明，过多的盐，具有增强淀粉酶活性而促进淀粉消化（消化食品），和促进小肠吸收游离葡萄糖的作用，可引起血糖浓度增高而加重病情。因此，糖尿病病人也不宜多吃盐。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 189,
                    "label": "运动疗法 也是糖尿病的基本治疗方法之一。应根据病人的实际情况，选择合适的运动项目，量力而行，循序渐进，贵在支持。运动方式、强度、频率应结合患者实际情况而定。一般推荐中等强度的有氧运动（如快走、打太极拳、骑车、打高尔夫球和园艺活动），运动时间每周至少150分钟。当血糖>14-16mmol/L、明显的低血糖症或血糖波动较大、有糖尿病急性代谢并发症以及各种心肾等器官严重慢性并发症者暂不适宜运动。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }
                ,
                {
                    "id": 190,
                    "label": "戒烟 吸烟有害健康，尤其对有大血管病变高度危险的2 型糖尿病患者。应劝诫每一位吸烟的糖尿病患者停止吸烟，这是生活方式干预的重要内容之一。",
                    "size": 66,
                    "scale": "1.1",
                    "color": "rgb(176,66,59)"
                }],
            "links": [
                {
                    "source": 1,
                    "target": 96,
                    "label": "概念"
                }
                ,
                {
                    "source": 2,
                    "target": 97,
                    "label": "概念"
                }
                ,
                {
                    "source": 3,
                    "target": 98,
                    "label": "概念"
                }
                ,
                {
                    "source": 4,
                    "target": 99,
                    "label": "概念"
                }
                ,
                {
                    "source": 5,
                    "target": 100,
                    "label": "概念"
                }
                ,
                {
                    "source": 6,
                    "target": 101,
                    "label": "概念"
                }
                ,
                {
                    "source": 7,
                    "target": 102,
                    "label": "概念"
                }
                ,
                {
                    "source": 8,
                    "target": 103,
                    "label": "概念"
                }
                ,
                {
                    "source": 9,
                    "target": 104,
                    "label": "概念"
                }
                ,
                {
                    "source": 10,
                    "target": 105,
                    "label": "概念"
                }
                ,
                {
                    "source": 11,
                    "target": 106,
                    "label": "概念"
                }
                ,
                {
                    "source": 12,
                    "target": 107,
                    "label": "概念"
                }
                ,
                {
                    "source": 13,
                    "target": 108,
                    "label": "概念"
                }
                ,
                {
                    "source": 14,
                    "target": 109,
                    "label": "概念"
                }
                ,
                {
                    "source": 15,
                    "target": 110,
                    "label": "概念"
                }
                ,
                {
                    "source": 16,
                    "target": 111,
                    "label": "概念"
                }
                ,
                {
                    "source": 17,
                    "target": 112,
                    "label": "概念"
                }
                ,
                {
                    "source": 18,
                    "target": 113,
                    "label": "概念"
                }
                ,
                {
                    "source": 19,
                    "target": 114,
                    "label": "概念"
                }
                ,
                {
                    "source": 20,
                    "target": 115,
                    "label": "概念"
                }
                ,
                {
                    "source": 21,
                    "target": 116,
                    "label": "概念"
                }
                ,
                {
                    "source": 22,
                    "target": 117,
                    "label": "概念"
                }
                ,
                {
                    "source": 23,
                    "target": 118,
                    "label": "概念"
                }
                ,
                {
                    "source": 24,
                    "target": 119,
                    "label": "概念"
                }
                ,
                {
                    "source": 25,
                    "target": 120,
                    "label": "概念"
                }
                ,
                {
                    "source": 26,
                    "target": 121,
                    "label": "概念"
                }
                ,
                {
                    "source": 27,
                    "target": 122,
                    "label": "概念"
                }
                ,
                {
                    "source": 28,
                    "target": 123,
                    "label": "概念"
                }
                ,
                {
                    "source": 29,
                    "target": 124,
                    "label": "概念"
                }
                ,
                {
                    "source": 30,
                    "target": 125,
                    "label": "概念"
                }
                ,
                {
                    "source": 31,
                    "target": 126,
                    "label": "概念"
                }
                ,
                {
                    "source": 32,
                    "target": 127,
                    "label": "概念"
                }
                ,
                {
                    "source": 33,
                    "target": 128,
                    "label": "概念"
                }
                ,
                {
                    "source": 34,
                    "target": 129,
                    "label": "概念"
                }
                ,
                {
                    "source": 35,
                    "target": 130,
                    "label": "概念"
                }
                ,
                {
                    "source": 36,
                    "target": 131,
                    "label": "概念"
                }
                ,
                {
                    "source": 37,
                    "target": 132,
                    "label": "概念"
                }
                ,
                {
                    "source": 38,
                    "target": 133,
                    "label": "概念"
                }
                ,
                {
                    "source": 39,
                    "target": 134,
                    "label": "概念"
                }
                ,
                {
                    "source": 40,
                    "target": 135,
                    "label": "概念"
                }
                ,
                {
                    "source": 41,
                    "target": 136,
                    "label": "概念"
                }
                ,
                {
                    "source": 42,
                    "target": 137,
                    "label": "概念"
                }
                ,
                {
                    "source": 43,
                    "target": 138,
                    "label": "概念"
                }
                ,
                {
                    "source": 44,
                    "target": 139,
                    "label": "概念"
                }
                ,
                {
                    "source": 45,
                    "target": 140,
                    "label": "概念"
                }
                ,
                {
                    "source": 46,
                    "target": 141,
                    "label": "概念"
                }
                ,
                {
                    "source": 47,
                    "target": 142,
                    "label": "概念"
                }
                ,
                {
                    "source": 48,
                    "target": 143,
                    "label": "概念"
                }
                ,
                {
                    "source": 49,
                    "target": 144,
                    "label": "概念"
                }
                ,
                {
                    "source": 50,
                    "target": 145,
                    "label": "概念"
                }
                ,
                {
                    "source": 51,
                    "target": 146,
                    "label": "概念"
                }
                ,
                {
                    "source": 52,
                    "target": 147,
                    "label": "概念"
                }
                ,
                {
                    "source": 53,
                    "target": 148,
                    "label": "概念"
                }
                ,
                {
                    "source": 54,
                    "target": 149,
                    "label": "概念"
                }
                ,
                {
                    "source": 55,
                    "target": 150,
                    "label": "概念"
                }
                ,
                {
                    "source": 56,
                    "target": 151,
                    "label": "概念"
                }
                ,
                {
                    "source": 57,
                    "target": 152,
                    "label": "概念"
                }
                ,
                {
                    "source": 58,
                    "target": 153,
                    "label": "概念"
                }
                ,
                {
                    "source": 59,
                    "target": 154,
                    "label": "概念"
                }
                ,
                {
                    "source": 60,
                    "target": 155,
                    "label": "概念"
                }
                ,
                {
                    "source": 61,
                    "target": 156,
                    "label": "概念"
                }
                ,
                {
                    "source": 62,
                    "target": 157,
                    "label": "概念"
                }
                ,
                {
                    "source": 63,
                    "target": 158,
                    "label": "概念"
                }
                ,
                {
                    "source": 64,
                    "target": 159,
                    "label": "概念"
                }
                ,
                {
                    "source": 65,
                    "target": 160,
                    "label": "概念"
                }
                ,
                {
                    "source": 66,
                    "target": 161,
                    "label": "概念"
                }
                ,
                {
                    "source": 67,
                    "target": 162,
                    "label": "概念"
                }
                ,
                {
                    "source": 68,
                    "target": 163,
                    "label": "概念"
                }
                ,
                {
                    "source": 69,
                    "target": 164,
                    "label": "概念"
                }
                ,
                {
                    "source": 70,
                    "target": 165,
                    "label": "概念"
                }
                ,
                {
                    "source": 71,
                    "target": 166,
                    "label": "概念"
                }
                ,
                {
                    "source": 72,
                    "target": 167,
                    "label": "概念"
                }
                ,
                {
                    "source": 73,
                    "target": 168,
                    "label": "概念"
                }
                ,
                {
                    "source": 74,
                    "target": 169,
                    "label": "概念"
                }
                ,
                {
                    "source": 75,
                    "target": 170,
                    "label": "概念"
                }
                ,
                {
                    "source": 76,
                    "target": 171,
                    "label": "概念"
                }
                ,
                {
                    "source": 77,
                    "target": 172,
                    "label": "概念"
                }
                ,
                {
                    "source": 78,
                    "target": 173,
                    "label": "概念"
                }
                ,
                {
                    "source": 79,
                    "target": 174,
                    "label": "概念"
                }
                ,
                {
                    "source": 80,
                    "target": 175,
                    "label": "概念"
                }
                ,
                {
                    "source": 81,
                    "target": 176,
                    "label": "概念"
                }
                ,
                {
                    "source": 82,
                    "target": 177,
                    "label": "概念"
                }
                ,
                {
                    "source": 83,
                    "target": 178,
                    "label": "概念"
                }
                ,
                {
                    "source": 84,
                    "target": 179,
                    "label": "概念"
                }
                ,
                {
                    "source": 85,
                    "target": 180,
                    "label": "概念"
                }
                ,
                {
                    "source": 86,
                    "target": 181,
                    "label": "概念"
                }
                ,
                {
                    "source": 87,
                    "target": 182,
                    "label": "概念"
                }
                ,
                {
                    "source": 88,
                    "target": 183,
                    "label": "概念"
                }
                ,
                {
                    "source": 89,
                    "target": 184,
                    "label": "概念"
                }
                ,
                {
                    "source": 90,
                    "target": 185,
                    "label": "概念"
                }
                ,
                {
                    "source": 91,
                    "target": 186,
                    "label": "概念"
                }
                ,
                {
                    "source": 92,
                    "target": 187,
                    "label": "概念"
                }
                ,
                {
                    "source": 93,
                    "target": 188,
                    "label": "概念"
                }
                ,
                {
                    "source": 94,
                    "target": 189,
                    "label": "概念"
                }
                ,
                {
                    "source": 95,
                    "target": 190,
                    "label": "概念"
                }
                ,
                {
                    "source": 1,
                    "target": 2,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 3,
                    "label": "包括"
                }
                ,
                {
                    "source": 2,
                    "target": 4,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 5,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 6,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 7,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 8,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 9,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 10,
                    "label": "包括"
                }
                ,
                {
                    "source": 5,
                    "target": 11,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 12,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 13,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 14,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 15,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 16,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 17,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 18,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 19,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 20,
                    "label": "包括"
                }
                ,
                {
                    "source": 12,
                    "target": 21,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 22,
                    "label": "包括"
                }
                ,
                {
                    "source": 22,
                    "target": 23,
                    "label": "包括"
                }
                ,
                {
                    "source": 22,
                    "target": 24,
                    "label": "包括"
                }
                ,
                {
                    "source": 22,
                    "target": 25,
                    "label": "包括"
                }
                ,
                {
                    "source": 22,
                    "target": 26,
                    "label": "包括"
                }
                ,
                {
                    "source": 26,
                    "target": 27,
                    "label": "包括"
                }
                ,
                {
                    "source": 26,
                    "target": 28,
                    "label": "包括"
                }
                ,
                {
                    "source": 26,
                    "target": 29,
                    "label": "包括"
                }
                ,
                {
                    "source": 26,
                    "target": 30,
                    "label": "包括"
                }
                ,
                {
                    "source": 26,
                    "target": 31,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 32,
                    "label": "包括"
                }
                ,
                {
                    "source": 32,
                    "target": 33,
                    "label": "包括"
                }
                ,
                {
                    "source": 32,
                    "target": 34,
                    "label": "包括"
                }
                ,
                {
                    "source": 32,
                    "target": 35,
                    "label": "包括"
                }
                ,
                {
                    "source": 32,
                    "target": 36,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 37,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 38,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 39,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 40,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 41,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 42,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 43,
                    "label": "包括"
                }
                ,
                {
                    "source": 37,
                    "target": 44,
                    "label": "包括"
                }
                ,
                {
                    "source": 44,
                    "target": 45,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 46,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 47,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 48,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 49,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 50,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 51,
                    "label": "包括"
                }
                ,
                {
                    "source": 46,
                    "target": 52,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 53,
                    "label": "包括"
                }
                ,
                {
                    "source": 53,
                    "target": 54,
                    "label": "包括"
                }
                ,
                {
                    "source": 53,
                    "target": 55,
                    "label": "包括"
                }
                ,
                {
                    "source": 53,
                    "target": 56,
                    "label": "包括"
                }
                ,
                {
                    "source": 53,
                    "target": 57,
                    "label": "包括"
                }
                ,
                {
                    "source": 53,
                    "target": 58,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 59,
                    "label": "包括"
                }
                ,
                {
                    "source": 59,
                    "target": 60,
                    "label": "包括"
                }
                ,
                {
                    "source": 59,
                    "target": 61,
                    "label": "包括"
                }
                ,
                {
                    "source": 59,
                    "target": 62,
                    "label": "包括"
                }
                ,
                {
                    "source": 59,
                    "target": 63,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 64,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 65,
                    "label": "包括"
                }
                ,
                {
                    "source": 45,
                    "target": 66,
                    "label": "包括"
                }
                ,
                {
                    "source": 66,
                    "target": 67,
                    "label": "包括"
                }
                ,
                {
                    "source": 67,
                    "target": 68,
                    "label": "包括"
                }
                ,
                {
                    "source": 67,
                    "target": 69,
                    "label": "包括"
                }
                ,
                {
                    "source": 66,
                    "target": 70,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 71,
                    "label": "包括"
                }
                ,
                {
                    "source": 71,
                    "target": 72,
                    "label": "包括"
                }
                ,
                {
                    "source": 71,
                    "target": 73,
                    "label": "包括"
                }
                ,
                {
                    "source": 71,
                    "target": 74,
                    "label": "包括"
                }
                ,
                {
                    "source": 74,
                    "target": 75,
                    "label": "包括"
                }
                ,
                {
                    "source": 74,
                    "target": 76,
                    "label": "包括"
                }
                ,
                {
                    "source": 74,
                    "target": 77,
                    "label": "包括"
                }
                ,
                {
                    "source": 74,
                    "target": 78,
                    "label": "包括"
                }
                ,
                {
                    "source": 78,
                    "target": 79,
                    "label": "包括"
                }
                ,
                {
                    "source": 78,
                    "target": 80,
                    "label": "包括"
                }
                ,
                {
                    "source": 78,
                    "target": 81,
                    "label": "包括"
                }
                ,
                {
                    "source": 74,
                    "target": 82,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 83,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 84,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 85,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 86,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 87,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 88,
                    "label": "包括"
                }
                ,
                {
                    "source": 83,
                    "target": 89,
                    "label": "包括"
                }
                ,
                {
                    "source": 1,
                    "target": 90,
                    "label": "包括"
                }
                ,
                {
                    "source": 90,
                    "target": 91,
                    "label": "包括"
                }
                ,
                {
                    "source": 90,
                    "target": 92,
                    "label": "包括"
                }
                ,
                {
                    "source": 90,
                    "target": 93,
                    "label": "包括"
                }
                ,
                {
                    "source": 90,
                    "target": 94,
                    "label": "包括"
                }
                ,
                {
                    "source": 90,
                    "target": 95,
                    "label": "包括"
                }]
        }
    }
});