define(function () {
    return{
        data:{
            "nodes":[
                {
                    "id": 1,
                    "label": "食品安全风险评估管理规定",
                    "size": 66,
                    "scale": "2.0",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 2,
                    "label": "第一条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 3,
                    "label": "第二条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 4,
                    "label": "第三条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 5,
                    "label": "第四条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 6,
                    "label": "第五条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 7,
                    "label": "第六条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 8,
                    "label": "第七条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 9,
                    "label": "第八条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 10,
                    "label": "第九条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 11,
                    "label": "第十条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 12,
                    "label": "第十一条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 13,
                    "label": "第十二条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 14,
                    "label": "第十三条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 15,
                    "label": "第十四条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 16,
                    "label": "第十五条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 17,
                    "label": "第十六条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 18,
                    "label": "第十七条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 19,
                    "label": "第十八条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 20,
                    "label": "第十九条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 21,
                    "label": "第二十条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 22,
                    "label": "第二十一条",
                    "size": 66,
                    "scale": "1.8",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 23,
                    "label": "为规范食品安全风险评估工作，根据《中华人民共和国食品安全法》和《中华人民共和国食品安全法实施条例》的有关规定，制定本规定。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 24,
                    "label": "本规定适用于国务院卫生行政部门依照食品安全法有关规定组织的食品安全风险评估工作。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 25,
                    "label": "卫生部负责组织食品安全风险评估工作，成立国家食品安全风险评估专家委员会，并及时将食品安全风险评估结果通报国务院有关部门。国务院有关部门按照有关法律法规和本规定的要求提出食品安全风险评估的建议，并提供有关信息和资料。地方人民政府有关部门应当按照风险所在的环节协助国务院有关部门收集食品安全风险评估有关的信息和资料。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 26,
                    "label": "国家食品安全风险评估专家委员会依据国家食品安全风险评估专家委员会章程组建。卫生部确定的食品安全风险评估技术机构负责承担食品安全风险评估相关科学数据、技术信息、检验结果的收集、处理、分析等任务。食品安全风险评估技术机构开展与风险评估相关工作接受国家食品安全风险评估专家委员会的委托和指导。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 27,
                    "label": "食品安全风险评估以食品安全风险监测和监督管理信息、科学数据以及其他有关信息为基础，遵循科学、透明和个案处理的原则进行。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 28,
                    "label": "国家食品安全风险评估专家委员会依据本规定及国家食品安全风险评估专家委员会章程独立进行风险评估，保证风险评估结果的科学、客观和公正。任何部门不得干预国家食品安全风险评估专家委员会和食品安全风险评估技术机构承担的风险评估相关工作。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 29,
                    "label": "有下列情形之一的，由卫生部审核同意后向国家食品安全风险评估专家委员会下达食品安全风险评估任务：（一）?? 为制订或修订食品安全国家标准提供科学依据需要进行风险评估的；（二）?? 通过食品安全风险监测或者接到举报发现食品可能存在安全隐患的，在组织进行检验后认为需要进行食品安全风险评估的；（三）?? 国务院有关部门按照《中华人民共和国食品安全法实施条例》第十二条要求提出食品安全风险评估的建议，并按规定提出《风险评估项目建议书》（见附表1）；（四）?? 卫生部根据法律法规的规定认为需要进行风险评估的其他情形。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 30,
                    "label": "国务院有关部门提交《风险评估项目建议书》时，应当向卫生部提供下列信息和资料：（一）?? 风险的来源和性质；（二）?? 相关检验数据和结论；（三）?? 风险涉及范围；（四）?? 其他有关信息和资料。卫生部根据食品安全风险评估的需要组织收集有关信息和资料，国务院有关部门和县级以上地方农业行政、质量监督、工商行政管理、食品药品监督管理等有关部门应当协助收集前款规定的食品安全风险评估信息和资料。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 31,
                    "label": "对于下列情形之一的，卫生部可以做出不予评估的决定：（一）?? 通过现有的监督管理措施可以解决的；（二）?? 通过检验和产品安全性评估可以得出结论的；（三）?? 国际政府组织有明确资料对风险进行了科学描述且适于我国膳食暴露模式的。对做出不予评估决定和因缺乏数据信息难以做出评估结论的，卫生部应当向有关方面说明原因和依据；如果国际组织已有评估结论的，应一并通报相关部门。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 32,
                    "label": "卫生部根据本规定第七条的规定和国家食品安全风险评估专家委员会的建议，确定国家食品安全风险评估计划和优先评估项目。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 33,
                    "label": "卫生部以《风险评估任务书》（见附表2）的形式向国家食品安全风险评估专家委员会下达风险评估任务。《风险评估任务书》应当包括风险评估的目的、需要解决的问题和结果产出形式等内容。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 34,
                    "label": "国家食品安全风险评估专家委员会应当根据评估任务提出风险评估实施方案，报卫生部备案。对于需要进一步补充信息的，可向卫生部提出数据和信息采集方案的建议。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 35,
                    "label": "国家食品安全风险评估专家委员会按照风险评估实施方案，遵循危害识别、危害特征描述、暴露评估和风险特征描述的结构化程序开展风险评估。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 36,
                    "label": "受委托的有关技术机构应当在国家食品安全风险评估专家委员会要求的时限内提交风险评估相关科学数据、技术信息、检验结果的收集、处理和分析的结果。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 37,
                    "label": "\"国家食品安全风险评估专家委员会进行风险评估",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 38,
                    "label": "发生下列情形之一的，卫生部可以要求国家食品安全风险评估专家委员会立即研究分析，对需要开展风险评估的事项，国家食品安全风险评估专家委员会应当立即成立临时工作组，制订应急评估方案。（一）?? 处理重大食品安全事故需要的；（二）?? 公众高度关注的食品安全问题需要尽快解答的；（三）?? 国务院有关部门监督管理工作需要并提出应急评估建议的；（四）?? 处理与食品安全相关的国际贸易争端需要的。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 39,
                    "label": "需要开展应急评估时，国家食品安全风险评估专家委员会按照应急评估方案进行风险评估，及时向卫生部提交风险评估结果报告。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 40,
                    "label": "卫生部应当依法向社会公布食品安全风险评估结果。风险评估结果由国家食品安全风险评估专家委员会负责解释。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 41,
                    "label": "本规定用语定义如下：危害：指食品中所含有的对健康有潜在不良影响的生物、化学、物理因素或食品存在状况。危害识别：根据流行病学、动物试验、体外试验、结构活性关系等科学数据和文献信息确定人体暴露于某种危害后是否会对健康造成不良影响、造成不良影响的可能性，以及可能处于风险之中的人群和范围。危害特征描述：对与危害相关的不良健康作用进行定性或定量描述。可以利用动物试验、临床研究以及流行病学研究确定危害与各种不良健康作用之间的剂量反应关系、作用机制等。如果可能，对于毒性作用有阈值的危害应建立人体安全摄入量水平。暴露评估：描述危害进入人体的途径，估算不同人群摄入危害的水平。根据危害在膳食中的水平和人群膳食消费量，初步估算危害的膳食总摄入量，同时考虑其他非膳食进入人体的途径，估算人体总摄入量并与安全摄入量进行比较。风险特征描述：在危害识别、危害特征描述和暴露评估的基础上，综合分析危害对人群健康产生不良作用的风险及其程度，同时应当描述和解释风险评估过程中的不确定性。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 42,
                    "label": "食品安全风险评估技术机构的认定和资格管理规定由卫生部另行制订。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }
                ,
                {
                    "id": 43,
                    "label": " 本办法由卫生部负责解释，自发布之日起实施。",
                    "size": 66,
                    "scale": "1.4",
                    "color": "rgb(173,216,230)"
                }


            ],
            "links":[
                {
                    "source": "1",
                    "target": "2",
                    "label": "包括"
                }
                ,
                {
                    "source": "2",
                    "target": "23",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "3",
                    "label": "包括"
                }
                ,
                {
                    "source": "3",
                    "target": "24",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "4",
                    "label": "包括"
                }
                ,
                {
                    "source": "4",
                    "target": "25",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "5",
                    "label": "包括"
                }
                ,
                {
                    "source": "5",
                    "target": "26",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "6",
                    "label": "包括"
                }
                ,
                {
                    "source": "6",
                    "target": "27",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "7",
                    "label": "包括"
                }
                ,
                {
                    "source": "7",
                    "target": "28",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "8",
                    "label": "包括"
                }
                ,
                {
                    "source": "8",
                    "target": "29",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "9",
                    "label": "包括"
                }
                ,
                {
                    "source": "9",
                    "target": "30",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "10",
                    "label": "包括"
                }
                ,
                {
                    "source": "10",
                    "target": "31",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "11",
                    "label": "包括"
                }
                ,
                {
                    "source": "11",
                    "target": "32",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "12",
                    "label": "包括"
                }
                ,
                {
                    "source": "12",
                    "target": "33",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "13",
                    "label": "包括"
                }
                ,
                {
                    "source": "13",
                    "target": "34",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "14",
                    "label": "包括"
                }
                ,
                {
                    "source": "14",
                    "target": "35",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "15",
                    "label": "包括"
                }
                ,
                {
                    "source": "15",
                    "target": "36",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "16",
                    "label": "包括"
                }
                ,
                {
                    "source": "16",
                    "target": "37",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "17",
                    "label": "包括"
                }
                ,
                {
                    "source": "17",
                    "target": "38",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "18",
                    "label": "包括"
                }
                ,
                {
                    "source": "18",
                    "target": "39",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "19",
                    "label": "包括"
                }
                ,
                {
                    "source": "19",
                    "target": "40",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "20",
                    "label": "包括"
                }
                ,
                {
                    "source": "20",
                    "target": "41",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "21",
                    "label": "包括"
                }
                ,
                {
                    "source": "21",
                    "target": "42",
                    "label": "内容"
                }
                ,
                {
                    "source": "1",
                    "target": "22",
                    "label": "包括"
                }
                ,
                {
                    "source": "22",
                    "target": "43",
                    "label": "内容"
                }
            ]
        }
    }

});